{"_id":{"$oid":"5a48fe83ce4385c520239051"},"title":"Intro to HTML5","description":"Learn how to build Web sites using HTML5 and basic CSS, directly from W3C, creator of the latest Web standards.","instructor":"Ujjwal Raj","lessons":[{"lesson_body":"HTML5 is the latest and most enhanced version of HTML.Technically, HTML is not a programming language, but rather a mark up language.\r\nBefore starting this tutorial you should be aware of the basic understanding of HTML and its tags.\r\nYou do not need to have your own environment to start learning HTML5 programming! We have set up an on-line compiler for you that can be used to compile and execute the programs on-line.\r\n\r\nFor most of the examples available in this tutorial, you will find a Try it option at the top right corner of the code box. Use it to verify the programs and check the outcome with different options. Feel free to modify any example and execute it online.HTML5 is the next major revision of the HTML standard superseding HTML 4.01, XHTML 1.0, and XHTML 1.1. HTML5 is a standard for structuring and presenting content on the World Wide Web.\r\n\r\nHTML5 is a cooperation between the World Wide Web Consortium (W3C) and the Web Hypertext Application Technology Working Group (WHATWG).\r\n\r\nThe new standard incorporates features like video playback and drag-and-drop that have been previously dependent on third-party browser plug-ins such as Adobe Flash, Microsoft Silverlight, and Google Gears.","lesson_title":"Introduction to HTML","lesson_number":1,"_id":{"$oid":"5a490103120b2578135655a6"}},{"lesson_body":"The HTML 5 language has a \"custom\" HTML syntax that is compatible with HTML 4 and XHTML1 documents published on the Web, but is not compatible with the more esoteric SGML features of HTML 4.\r\n\r\nHTML 5 does not have the same syntax rules as XHTML where we needed lower case tag names, quoting our attributes,an attribute had to have a value and to close all empty elements.\r\n\r\nBut HTML5 is coming with lots of flexibility and would support the followings −\r\n\r\n    Uppercase tag names.\r\n    Quotes are optional for attributes.\r\n    Attribute values are optional.\r\n    Closing empty elements are optional.\r\nOCTYPEs in older versions of HTML were longer because the HTML language was SGML based and therefore required a reference to a DTD.\r\n\r\nHTML 5 authors would use simple syntax to specify DOCTYPE as follows −\r\n\r\n\u003c!DOCTYPE html\u003e\r\n\r\nAll the above syntax is case-insensitive.\r\nCharacter Encoding\r\n\r\nHTML 5 authors can use simple syntax to specify Character Encoding as follows −\r\n\r\n\u003cmeta charset=\"UTF-8\"\u003e\r\n\r\nAll the above syntax is case-insensitive.\r\nThe \u003cscript\u003e tag\r\n\r\nIt's common practice to add a type attribute with a value of \"text/javascript\" to script elements as follows −\r\n\r\n\u003cscript type=\"text/javascript\" src=\"scriptfile.js\"\u003e\u003c/script\u003e","lesson_title":"Starting HTML5 Programming","lesson_number":2,"_id":{"$oid":"5a49014d120b2578135655a7"}},{"lesson_body":"HTML5 is the next major revision of the HTML standard superseding HTML 4.01, XHTML 1.0, and XHTML 1.1. HTML5 is a standard for structuring and presenting content on the World Wide Web.HTML5 is a cooperation between the World Wide Web Consortium (W3C) and the Web Hypertext Application Technology Working Group (WHATWG).The new standard incorporates features like video playback and drag-and-drop that have been previously dependent on third-party browser plug-ins such as Adobe Flash, Microsoft Silverlight, and Google Gears.HTML5 is designed, as much as possible, to be backward compatible with existing web browsers. New features build on existing features and allow you to provide fallback content for older browsers.It is suggested to detect support for individual HTML5 features using a few lines of JavaScript.If you are not familiar with any previous version of HTML, I would recommend to go through our HTML Tutorial before you explore further concepts of HTM5.","lesson_title":"HTML Basics","lesson_number":3,"_id":{"$oid":"5a4901e7120b2578135655a8"}},{"lesson_body":" Link tag ------ \u003clink rel=\\\"stylesheet\\\" type=\\\"text/css\\\" href=\\\"stylefile.css\\\"\u003e                                                                                                                                                     Division tag ---- \u003cdiv class=\\\"example\\\"\u003e...\u003c/div\u003e  .The following tags have been introduced for better structure:-a] section b] article c] aside d] header e] footer f] nav g] dialog h] figure                                Some attributes are defined globally and can be used on any element, while others are defined for specific elements only.A new feature being introduced in HTML 5 is the addition of custom data attributes.A custom data attribute starts with data- and would be named based on your requirement. Following is the simple example −\u003cdiv class=\\\"example\\\" data-subject=\\\"physics\\\" data-level=\\\"complex\\\"\u003e   ...\u003c/div\u003e.The above will be perfectly valid HTML5 with two custom attributes called data-subject and data-level. You would be able to get the values of these attributes using JavaScript APIs or CSS in similar way as you get for standard attributes.","lesson_title":"Tags\u0026Elements","lesson_number":4,"_id":{"$oid":"5a490262120b2578135655a9"}},{"lesson_body":"Drag and Drop (DnD) is powerful User Interface concept which makes it easy to copy, reorder and deletion of items with the help of mouse clicks. This allows the user to click and hold the mouse button down over an element, drag it to another location, and release the mouse button to drop the element there.\r\n\r\nTo achieve drag and drop functionality with traditional HTML4, developers would either have to either have to use complex Javascript programming or other Javascript frameworks like jQuery etc.\r\n\r\nNow HTML 5 came up with a Drag and Drop (DnD) API that brings native DnD support to the browser making it much easier to code up.\r\n\r\nHTML 5 DnD is supported by all the major browsers like Chrome, Firefox 3.5 and Safari 4 etc.he event listener methods for all the drag and drop events accept Event object which has a readonly attribute called dataTransfer. The event.dataTransfer returns DataTransfer object associated with the event .The DataTransfer object holds data about the drag and drop operation. This data can be retrieved and set in terms of various attributes associated with DataTransfer object.","lesson_title":"Drag \u0026 Drop","lesson_number":5,"_id":{"$oid":"5a4902e4120b2578135655aa"}},{"lesson_body":"The situation explained above can be handled using Web Workers who will do all the computationally expensive tasks without interrupting the user interface and typically run on separate threads.\r\n\r\nWeb Workers allow for long-running scripts that are not interrupted by scripts that respond to clicks or other user interactions, and allows long tasks to be executed without yielding to keep the page responsive.\r\n\r\nWeb Workers are background scripts and they are relatively heavy-weight, and are not intended to be used in large numbers. For example, it would be inappropriate to launch one worker for each pixel of a four megapixel image.\r\n\r\nWhen a script is executing inside a Web Worker it cannot access the web page's window object (window.document), which means that Web Workers don't have direct access to the web page and the DOM API. Although Web Workers cannot block the browser UI, they can still consume CPU cycles and make the system less responsive.Web Workers are initialized with the URL of a JavaScript file, which contains the code the worker will execute. This code sets event listeners and communicates with the script that spawned it from the main page. Following is the simple syntax −\r\n\r\nvar worker = new Worker('bigLoop.js');\r\n\r\nIf the specified javascript file exists, the browser will spawn a new worker thread, which is downloaded asynchronously. If the path to your worker returns an 404, the worker will fail silently.\r\n\r\nIf your application has multiple supporting javascript files, you can import them importScripts() method which takes file name(s) as argument separated by comma as follows −\r\n\r\nimportScripts(\"helper.js\", \"anotherHelper.js\");\r\n\r\nOnce the Web Worker is spawned, communication between web worker and its parent page is done using the postMessage() method. Depending on your browser/version, postMessage() can accept either a string or JSON object as its single argument.\r\n\r\nMessage passed by Web Worker is accessed using onmessage event in the main page. Now let us write our bigLoop example using Web Worker. Below is the main page (hello.htm) which will spawn a web worker to execute the loop and to return the final value of variable j −","lesson_title":"Web Workers","lesson_number":6,"_id":{"$oid":"5a490317120b2578135655ab"}},{"lesson_body":"HTML5 Geolocation API lets you share your location with your favorite web sites. A Javascript can capture your latitude and longitude and can be sent to backend web server and do fancy location-aware things like finding local businesses or showing your location on a map.\r\n\r\nToday most of the browsers and mobile devices support Geolocation API. The geolocation APIs work with a new property of the global navigator object ie. Geolocation object which can be created as follows:\r\n\r\nvar geolocation = navigator.geolocation;\r\n\r\nThe geolocation object is a service object that allows widgets to retrieve information about the geographic location of the device.Geolocation methods getCurrentPosition() and getPositionUsingMethodName() specify the callback method that retrieves the location information. These methods are called asynchronously with an object Position which stores the complete location information.\r\n\r\nThe Position object specifies the current geographic location of the device. The location is expressed as a set of geographic coordinates together with information about heading and speed.\r\n\r\nThe following table describes the properties of the Position object. For the optional properties if the system cannot provide a value, the value of the property is set to null.","lesson_title":"HTML5 Geolocation","lesson_number":7,"_id":{"$oid":"5a49035e120b2578135655ac"}},{"lesson_body":"The W3C Markup Validator checks the markup validity of Web documents in HTML, XHTML, SMIL, MathML, etc. This validator is part of Unicorn, W3C's unified validator service.\r\n\r\nTo use this validator for HTML5, you need to use More Options and select Document Type as HTML5 (experimental) .Here is the another currently known HTML5 validators: Henri's Validator.nu (X)HTML5 Validator (Highly Experimental) .","lesson_title":"Markup Validator","lesson_number":8,"_id":{"$oid":"5a4903b1120b2578135655ad"}}]}
{"_id":{"$oid":"5a48fe8ece4385c520239052"},"title":"Machine learning","description":"The objective of this course is to give you a wholistic understanding of machine learning, covering theory, application, and inner workings of supervised, unsupervised, and deep learning algorithms.","instructor":"Alex Steven","lessons":[{"lesson_body":"Apache Mahout is a highly scalable machine learning library that enables developers to use optimized algorithms. Mahout implements popular machine learning techniques such as recommendation, classification, and clustering. Therefore, it is prudent to have a brief section on machine learning before we move further.We are living in a day and age where information is available in abundance. The information overload has scaled to such heights that sometimes it becomes difficult to manage our little mailboxes! Imagine the volume of data and records some of the popular websites (the likes of Facebook, Twitter, and Youtube) have to collect and manage on a daily basis. It is not uncommon even for lesser known websites to receive huge amounts of information in bulk.\r\n\r\nNormally we fall back on data mining algorithms to analyze bulk data to identify trends and draw conclusions. However, no data mining algorithm can be efficient enough to process very large datasets and provide outcomes in quick time, unless the computational tasks are run on multiple machines distributed over the cloud.\r\n\r\nWe now have new frameworks that allow us to break down a computation task into multiple segments and run each segment on a different machine. Mahout is such a data mining framework that normally runs coupled with the Hadoop infrastructure at its background to manage huge volumes of data.\r\nA mahout is one who drives an elephant as its master. The name comes from its close association with Apache Hadoop which uses an elephant as its logo.\r\n\r\nHadoop is an open-source framework from Apache that allows to store and process big data in a distributed environment across clusters of computers using simple programming models.\r\n\r\nApache Mahout is an open source project that is primarily used for creating scalable machine learning algorithms. It implements popular machine learning techniques such as:\r\n\r\n    Recommendation\r\n    Classification\r\n    Clustering\r\n\r\nApache Mahout started as a sub-project of Apache’s Lucene in 2008. In 2010, Mahout became a top level project of Apache.","lesson_title":"Introduction to Mahout","lesson_number":1,"_id":{"$oid":"5a492c237827f824099ac961"}},{"lesson_body":"Machine learning is a branch of science that deals with programming the systems in such a way that they automatically learn and improve with experience. Here, learning means recognizing and understanding the input data and making wise decisions based on the supplied data.\r\n\r\nIt is very difficult to cater to all the decisions based on all possible inputs. To tackle this problem, algorithms are developed. These algorithms build knowledge from specific data and past experience with the principles of statistics, probability theory, logic, combinatorial optimization, search, reinforcement learning, and control theory.\r\n\r\nThe developed algorithms form the basis of various applications such as:\r\n\r\n    Vision processing\r\n    Language processing\r\n    Forecasting (e.g., stock market trends)\r\n    Pattern recognition\r\n    Games\r\n    Data mining\r\n    Expert systems\r\n    Robotics\r\n\r\nMachine learning is a vast area and it is quite beyond the scope of this tutorial to cover all its features. There are several ways to implement machine learning techniques, however the most commonly used ones are supervised and unsupervised learning.\r\nSupervised Learning\r\n\r\nSupervised learning deals with learning a function from available training data. A supervised learning algorithm analyzes the training data and produces an inferred function, which can be used for mapping new examples. Common examples of supervised learning include:\r\n\r\n    classifying e-mails as spam,\r\n    labeling webpages based on their content, and\r\n    voice recognition.\r\n\r\nThere are many supervised learning algorithms such as neural networks, Support Vector Machines (SVMs), and Naive Bayes classifiers. Mahout implements Naive Bayes classifier.\r\nUnsupervised Learning\r\n\r\nUnsupervised learning makes sense of unlabeled data without having any predefined dataset for its training. Unsupervised learning is an extremely powerful tool for analyzing available data and look for patterns and trends. It is most commonly used for clustering similar input into logical groups. Common approaches to unsupervised learning include:\r\n\r\n    k-means\r\n    self-organizing maps, and\r\n    hierarchical clustering\r\n\r\nRecommendation\r\n\r\nRecommendation is a popular technique that provides close recommendations based on user information such as previous purchases, clicks, and ratings.\r\n\r\n    Amazon uses this technique to display a list of recommended items that you might be interested in, drawing information from your past actions. There are recommender engines that work behind Amazon to capture user behavior and recommend selected items based on your earlier actions.\r\n\r\n    Facebook uses the recommender technique to identify and recommend the “people you may know list”.\r\nClassification\r\n\r\nClassification, also known as categorization, is a machine learning technique that uses known data to determine how the new data should be classified into a set of existing categories. Classification is a form of supervised learning.\r\n\r\n    Mail service providers such as Yahoo! and Gmail use this technique to decide whether a new mail should be classified as a spam. The categorization algorithm trains itself by analyzing user habits of marking certain mails as spams. Based on that, the classifier decides whether a future mail should be deposited in your inbox or in the spams folder.\r\n\r\n    iTunes application uses classification to prepare playlists.\r\nClustering\r\n\r\nClustering is used to form groups or clusters of similar data based on common characteristics. Clustering is a form of unsupervised learning.\r\n\r\n    Search engines such as Google and Yahoo! use clustering techniques to group data with similar characteristics.\r\n\r\n    Newsgroups use clustering techniques to group various articles based on related topics.\r\n\r\nThe clustering engine goes through the input data completely and based on the characteristics of the data, it will decide under which cluster it should be grouped. Take a look at the following example.","lesson_title":"Intro to ML","lesson_number":2,"_id":{"$oid":"5a492c747827f824099ac962"}},{"lesson_body":"This chapter teaches you how to setup mahout. Java and Hadoop are the prerequisites of mahout. Below given are the steps to download and install Java, Hadoop, and Mahout.Pre-Installation Setup\r\n\r\nBefore installing Hadoop into Linux environment, we need to set up Linux using ssh (Secure Shell). Follow the steps mentioned below for setting up the Linux environment.\r\nCreating a User\r\n\r\nIt is recommended to create a separate user for Hadoop to isolate the Hadoop file system from the Unix file system. Follow the steps given below to create a user:\r\n\r\n    Open root using the command “su”.\r\n\r\n    Create a user from the root account using the command “useradd username”.\r\n\r\n    Now you can open an existing user account using the command “su username”.\r\n\r\n    Open the Linux terminal and type the following commands to create a user.\r\nSSH Setup and Key Generation\r\n\r\nSSH setup is required to perform different operations on a cluster such as starting, stopping, and distributed daemon shell operations. To authenticate different users of Hadoop, it is required to provide public/private key pair for a Hadoop user and share it with different users.Installing Java\r\n\r\nJava is the main prerequisite for Hadoop and HBase. First of all, you should verify the existence of Java in your system using “java -version”. ","lesson_title":"ML-Environment Setup","lesson_number":3,"_id":{"$oid":"5a492f797827f824099ac963"}},{"lesson_body":"This chapter covers the popular machine learning technique called recommendation, its mechanisms, and how to write an application implementing Mahout recommendation.\r\nRecommendation\r\n\r\nEver wondered how Amazon comes up with a list of recommended items to draw your attention to a particular product that you might be interested in!\r\n\r\nSuppose you want to purchase the book “Mahout in Action” from Amazon:\r\nSuch recommendation lists are produced with the help of recommender engines. Mahout provides recommender engines of several types such as:\r\n\r\n    user-based recommenders,\r\n    item-based recommenders, and\r\n    several other algorithms.\r\n\r\nMahout Recommender Engine\r\n\r\nMahout has a non-distributed, non-Hadoop-based recommender engine. You should pass a text document having user preferences for items. And the output of this engine would be the estimated preferences of a particular user for other items.\r\nExample\r\n\r\nConsider a website that sells consumer goods such as mobiles, gadgets, and their accessories. If we want to implement the features of Mahout in such a site, then we can build a recommender engine. This engine analyzes past purchase data of the users and recommends new products based on that.\r\n\r\nThe components provided by Mahout to build a recommender engine are as follows:\r\n\r\n    DataModel\r\n    UserSimilarity\r\n    ItemSimilarity\r\n    UserNeighborhood\r\n    Recommender\r\n\r\nFrom the data store, the data model is prepared and is passed as an input to the recommender engine. The Recommender engine generates the recommendations for a particular user. Given below is the architecture of recommender engine.","lesson_title":"ML-Recommendation","lesson_number":4,"_id":{"$oid":"5a492fba7827f824099ac964"}},{"lesson_body":"Clustering is the procedure to organize elements or items of a given collection into groups based on the similarity between the items. For example, the applications related to online news publishing group their news articles using clustering.\r\nApplications of Clustering\r\n\r\n    Clustering is broadly used in many applications such as market research, pattern recognition, data analysis, and image processing.\r\n\r\n    Clustering can help marketers discover distinct groups in their customer basis. And they can characterize their customer groups based on purchasing patterns.\r\n\r\n    In the field of biology, it can be used to derive plant and animal taxonomies, categorize genes with similar functionality and gain insight into structures inherent in populations.\r\n\r\n    Clustering helps in identification of areas of similar land use in an earth observation database.\r\n\r\n    Clustering also helps in classifying documents on the web for information discovery.\r\n\r\n    Clustering is used in outlier detection applications such as detection of credit card fraud.\r\n\r\n    As a data mining function, Cluster Analysis serves as a tool to gain insight into the distribution of data to observe characteristics of each cluster.\r\n\r\nUsing Mahout, we can cluster a given set of data. The steps required are as follows:\r\n\r\n    Algorithm You need to select a suitable clustering algorithm to group the elements of a cluster.\r\n\r\n    Similarity and Dissimilarity You need to have a rule in place to verify the similarity between the newly encountered elements and the elements in the groups.\r\n\r\n    Stopping Condition A stopping condition is required to define the point where no clustering is required.\r\n\r\nProcedure of Clustering\r\n\r\nTo cluster the given data you need to -\r\n\r\n    Start the Hadoop server. Create required directories for storing files in Hadoop File System. (Create directories for input file, sequence file, and clustered output in case of canopy).\r\n\r\n    Copy the input file to the Hadoop File system from Unix file system.\r\n\r\n    Prepare the sequence file from the input data.\r\n\r\n    Run any of the available clustering algorithms.\r\n\r\n    Get the clustered data.\r\n","lesson_title":"ML-Clustering","lesson_number":5,"_id":{"$oid":"5a492fe47827f824099ac965"}},{"lesson_body":"Classification is a machine learning technique that uses known data to determine how the new data should be classified into a set of existing categories. For example,\r\n\r\n    iTunes application uses classification to prepare playlists.\r\n\r\n    Mail service providers such as Yahoo! and Gmail use this technique to decide whether a new mail should be classified as a spam. The categorization algorithm trains itself by analyzing user habits of marking certain mails as spams. Based on that, the classifier decides whether a future mail should be deposited in your inbox or in the spams folder.\r\n\r\nHow Classification Works\r\n\r\nWhile classifying a given set of data, the classifier system performs the following actions:\r\n\r\n    Initially a new data model is prepared using any of the learning algorithms.\r\n    Then the prepared data model is tested.\r\n    Thereafter, this data model is used to evaluate the new data and to determine its class.\r\nApplications of Classification\r\n\r\n    Credit card fraud detection - The Classification mechanism is used to predict credit card frauds. Using historical information of previous frauds, the classifier can predict which future transactions may turn into frauds.\r\n\r\n    Spam e-mails - Depending on the characteristics of previous spam mails, the classifier determines whether a newly encountered e-mail should be sent to the spam folder.\r\n\r\nNaive Bayes Classifier\r\n\r\nMahout uses the Naive Bayes classifier algorithm. It uses two implementations:\r\n\r\n    Distributed Naive Bayes classification\r\n    Complementary Naive Bayes classification\r\n\r\nNaive Bayes is a simple technique for constructing classifiers. It is not a single algorithm for training such classifiers, but a family of algorithms. A Bayes classifier constructs models to classify problem instances. These classifications are made using the available data.\r\n\r\nAn advantage of naive Bayes is that it only requires a small amount of training data to estimate the parameters necessary for classification.\r\n\r\nFor some types of probability models, naive Bayes classifiers can be trained very efficiently in a supervised learning setting.\r\n\r\nDespite its oversimplified assumptions, naive Bayes classifiers have worked quite well in many complex real-world situations.\r\nProcedure of Classification\r\n\r\nThe following steps are to be followed to implement Classification:\r\n\r\n    Generate example data\r\n    Create sequence files from data\r\n    Convert sequence files to vectors\r\n    Train the vectors\r\n    Test the vectors\r\n","lesson_title":"ML-Classification","lesson_number":6,"_id":{"$oid":"5a49302f7827f824099ac966"}}]}
{"_id":{"$oid":"5a48fe96ce4385c520239053"},"title":"Big Data Analytics","description":"Data which are very large in size is called Big Data. Normally we work on data of size MB(WordDoc ,Excel) or maximum GB(Movies, Codes) but data in Peta bytes i.e. 10^15 byte size is called Big Data. It is stated that almost 90% of today's data has been generated in the past 3 years.","instructor":"S.S.Bissoyi","lessons":[{"lesson_body":"Data which are very large in size is called Big Data. Normally we work on data of size MB(WordDoc ,Excel) or maximum GB(Movies, Codes) but data in Peta bytes i.e. 10^15 byte size is called Big Data. It is stated that almost 90% of today's data has been generated in the past 3 years.\r\nThese data come from many sources like\r\n\r\n    Social networking sites: Facebook, Google, LinkedIn all these sites generates huge amount of data on a day to day basis as they have billions of users worldwide.\r\n    E-commerce site: Sites like Amazon, Flipkart, Alibaba generates huge amount of logs from which users buying trends can be traced.\r\n    Weather Station: All the weather station and satellite gives very huge data which are stored and manipulated to forecast weather.\r\n    Telecom company: Telecom giants like Airtel, Vodafone study the user trends and accordingly publish their plans and for this they store the data of its million users.\r\n    Share Market: Stock exchange across the world generates huge amount of data through its daily transaction.\r\n\r\n3V's of Big Data\r\n\r\n    Velocity: The data is increasing at a very fast rate. It is estimated that the volume of data will double in every 2 years.\r\n    Variety: Now a days data are not stored in rows and column. Data is structured as well as unstructured. Log file, CCTV footage is unstructured data. Data which can be saved in tables are structured data like the transaction data of the bank.\r\n    Volume: The amount of data which we deal with is of very large size of Peta bytes.\r\n\r\nUse case\r\n\r\nAn e-commerce site XYZ (having 100 million users) wants to offer a gift voucher of 100$ to its top 10 customers who have spent the most in the previous year.Moreover, they want to find the buying trend of these customers so that company can suggest more items related to them.Huge amount of unstructured data which needs to be stored, processed and analyzed.Storage: This huge amount of data, Hadoop uses HDFS (Hadoop Distributed File System) which uses commodity hardware to form clusters and store data in a distributed fashion. It works on Write once, read many times principle.","lesson_title":"What is Big Data?","lesson_number":1,"_id":{"$oid":"5a49314b7827f824099ac96b"}},{"lesson_body":"  Hadoop is an open source framework from Apache and is used to store process and analyze data which are very huge in volume. Hadoop is written in Java and is not OLAP (online analytical processing). It is used for batch/offline processing.It is being used by Facebook, Yahoo, Google, Twitter, LinkedIn and many more. Moreover it can be scaled up just by adding nodes in the cluster.Modules of Hadoop.\r\n\r\n    HDFS: Hadoop Distributed File System. Google published its paper GFS and on the basis of that HDFS was developed. It states that the files will be broken into blocks and stored in nodes over the distributed architecture.\r\n    Yarn: Yet another Resource Negotiator is used for job scheduling and manage the cluster.\r\n    Map Reduce: This is a framework which helps Java programs to do the parallel computation on data using key value pair. The Map task takes input data and converts it into a data set which can be computed in Key value pair. The output of Map task is consumed by reduce task and then the out of reducer gives the desired result.\r\n    Hadoop Common: These Java libraries are used to start Hadoop and are used by other Hadoop modules.\r\nAdvantages of Hadoop\r\n\r\n    Fast: In HDFS the data distributed over the cluster and are mapped which helps in faster retrieval. Even the tools to process the data are often on the same servers, thus reducing the processing time. It is able to process terabytes of data in minutes and Peta bytes in hours.\r\n    Scalable: Hadoop cluster can be extended by just adding nodes in the cluster.\r\n    Cost Effective: Hadoop is open source and uses commodity hardware to store data so it really cost effective as compared to traditional relational database management system.\r\n    Resilient to failure: HDFS has the property with which it can replicate data over the network, so if one node is down or some other network failure happens, then Hadoop takes the other copy of data and use it. Normally, data are replicated thrice but the replication factor is configurable.\r\n","lesson_title":"Introduction to Hadoop","lesson_number":2,"_id":{"$oid":"5a4938097827f824099ac96c"}},{"lesson_body":"Hadoop Installation\r\n\r\nEnvironment required for Hadoop: The production environment of Hadoop is UNIX, but it can also be used in Windows using Cygwin. Java 1.6 or above is needed to run Map Reduce Programs. For Hadoop installation from tar ball on the UNIX environment you need\r\n\r\n    Java Installation\r\n    SSH installation\r\n    Hadoop Installation and File Configuration\r\n","lesson_title":"Hadoop Installation","lesson_number":3,"_id":{"$oid":"5a49384e7827f824099ac96d"}},{"lesson_body":"Hadoop comes with a distributed file system called HDFS. In HDFS data is distributed over several machines and replicated to ensure their durability to failure and high availability to parallel application.\r\n\r\nIt is cost effective as it uses commodity hardware. It involves the concept of blocks, data nodes and node name.\r\nWhere to use HDFS\r\n\r\n    Very Large Files: Files should be of hundreds of megabytes, gigabytes or more.\r\n    Streaming Data Access: The time to read whole data set is more important than latency in reading the first. HDFS is built on write-once and read-many-times pattern.\r\n    Commodity Hardware:It works on low cost hardware.\r\n\r\nWhere not to use HDFS\r\n\r\n    Low Latency data access: Applications that require very less time to access the first data should not use HDFS as it is giving importance to whole data rather than time to fetch the first record.\r\n    Lots Of Small Files:The name node contains the metadata of files in memory and if the files are small in size it takes a lot of memory for name node's memory which is not feasible.\r\n    Multiple Writes:It should not be used when we have to write multiple times.\r\n\r\nHDFS Concepts\r\n\r\n    Blocks: A Block is the minimum amount of data that it can read or write.HDFS blocks are 128 MB by default and this is configurable.Files n HDFS are broken into block-sized chunks,which are stored as independent units.Unlike a file system, if the file is in HDFS is smaller than block size, then it does not occupy full block?s size, i.e. 5 MB of file stored in HDFS of block size 128 MB takes 5MB of space only.The HDFS block size is large just to minimize the cost of seek.\r\n    Name Node: HDFS works in master-worker pattern where the name node acts as master.Name Node is controller and manager of HDFS as it knows the status and the metadata of all the files in HDFS; the metadata information being file permission, names and location of each block.The metadata are small, so it is stored in the memory of name node,allowing faster access to data. Moreover the HDFS cluster is accessed by multiple clients concurrently,so all this information is handled bya single machine. The file system operations like opening, closing, renaming etc. are executed by it.\r\n    Data Node: They store and retrieve blocks when they are told to; by client or name node. They report back to name node periodically, with list of blocks that they are storing. The data node being a commodity hardware also does the work of block creation, deletion and replication as stated by the name node.\r\n","lesson_title":"Modules-HDFS","lesson_number":4,"_id":{"$oid":"5a4938807827f824099ac96e"}},{"lesson_body":"Yet Another Resource Manager takes programming to the next level beyond Java , and makes it interactive to let another application Hbase, Spark etc. to work on it.Different Yarn applications can co-exist on the same cluster so MapReduce, Hbase, Spark all can run at the same time bringing great benefits for manageability and cluster utilization.\r\nComponents Of YARN\r\n\r\n    Client: For submitting MapReduce jobs.\r\n    Resource Manager: To manage the use of resources across the cluster\r\n    Node Manager:For launching and monitoring the computer containers on machines in the cluster.\r\n    Map Reduce Application Master: Checks tasks running the MapReduce job. The application master and the MapReduce tasks run in containers that are scheduled by the resource manager, and managed by the node managers.\r\n\r\nJobtracker \u0026 Tasktrackerwere were used in previous version of Hadoop, which were responsible for handling resources and checking progress management. However, Hadoop 2.0 has Resource manager and NodeManager to overcome the shortfall of Jobtracker \u0026 Tasktracker.\r\nBenefits of YARN\r\n\r\n    Scalability: Map Reduce 1 hits ascalability bottleneck at 4000 nodes and 40000 task, but Yarn is designed for 10,000 nodes and 1 lakh tasks.\r\n    Utiliazation: Node Manager manages a pool of resources, rather than a fixed number of the designated slots thus increasing the utilization.\r\n    Multitenancy: Different version of MapReduce can run on YARN, which makes the process of upgrading MapReduce more manageable.\r\n","lesson_title":"Modules-Yarn","lesson_number":5,"_id":{"$oid":"5a4938ad7827f824099ac96f"}},{"lesson_body":"To take the advantage of parallel processing of Hadoop, the query must be in MapReduce form. The MapReduce is a paradigm which has two phases, the mapper phase and the reducer phase. In the Mapper the input is given in the form of key value pair. The output of the mapper is fed to the reducer as input. The reducer runs only after the mapper is over. The reducer too takes input in key value format and the output of reducer is final output.\r\nSteps in Map Reduce\r\n\r\n    Map takes a data in the form of pairs and returns a list of \u003ckey, value\u003e pairs. The keys will not be unique in this case.\r\n    Using the output of Map, sort and shuffle are applied by the Hadoop architecture. This sort and shuffle acts on these list of \u003ckey, value\u003e pairs and sends out unique keys and a list of values associated with this unique key \u003ckey, list(values)\u003e.\r\n    Output of sort and shuffle will be sent to reducer phase. Reducer will perform a defined function on list of values for unique keys and Final output will\u003ckey, value\u003e will be stored/displayed.\r\nHow Many Maps\r\n\r\nThe size of data to be processed decides the number of maps required. For example, we have 1000 MB data and block size is 64 MB then we need 16 mappers.\r\nSort and Shuffle\r\n\r\nThe sort and shuffle occur on the output of mapper and before the reducer.When the mapper task is complete, the results are sorted by key, partitioned if there are multiple reducers, and then written to disk.Using the input from each mapper \u003ck2,v2\u003e , we collect all the values for each unique key k2. This output from the shuffle phase in the form of \u003ck2,list(v2)\u003e is sent as input to reducer phase.","lesson_title":"Modules-MapReduce","lesson_number":6,"_id":{"$oid":"5a4938eb7827f824099ac970"}}]}
{"_id":{"$oid":"5a49058de9ef9d384036f25f"},"title":"PHP-Web Development","description":"PHP, shortened for Hypertext Preprocessor, originally stood for a ‘Personal Home Page’ back when it wasn’t this famous. However, today it is the most commonly used server-side programming language. It’s popularity stems from it’s ease of use and the freedom to be able to manipulate your webpage to your heart’s content.","instructor":"John Elder","lessons":[{"lesson_body":"PHP started out as a small open source project that evolved as more and more people found out how useful it was. Rasmus Lerdorf unleashed the first version of PHP way back in 1994.\r\n\r\n    PHP is a recursive acronym for \"PHP: Hypertext Preprocessor\".\r\n\r\n    PHP is a server side scripting language that is embedded in HTML. It is used to manage dynamic content, databases, session tracking, even build entire e-commerce sites.\r\n\r\n    It is integrated with a number of popular databases, including MySQL, PostgreSQL, Oracle, Sybase, Informix, and Microsoft SQL Server.\r\n\r\n    PHP is pleasingly zippy in its execution, especially when compiled as an Apache module on the Unix side. The MySQL server, once started, executes even very complex queries with huge result sets in record-setting time.\r\n\r\n    PHP supports a large number of major protocols such as POP3, IMAP, and LDAP. PHP4 added support for Java and distributed object architectures (COM and CORBA), making n-tier development a possibility for the first time.\r\n\r\n    PHP is forgiving: PHP language tries to be as forgiving as possible.\r\n\r\n    PHP Syntax is C-Like.\r\nCommon uses of PHP\r\n\r\n    PHP performs system functions, i.e. from files on a system it can create, open, read, write, and close them.\r\n\r\n    PHP can handle forms, i.e. gather data from files, save data to a file, through email you can send data, return data to the user.\r\n\r\n    You add, delete, modify elements within your database through PHP.\r\n\r\n    Access cookies variables and set cookies.\r\n\r\n    Using PHP, you can restrict users to access some pages of your website.\r\n\r\n    It can encrypt data.\r\n","lesson_title":"PHP-Introduction","lesson_number":1,"_id":{"$oid":"5a4906b943aa813428df63f5"}},{"lesson_body":"In order to develop and run PHP Web pages three vital components need to be installed on your computer system.\r\n\r\n    Web Server − PHP will work with virtually all Web Server software, including Microsoft's Internet Information Server (IIS) but then most often used is freely available Apache Server. Download Apache for free here − https://httpd.apache.org/download.cgi\r\n\r\n    Database − PHP will work with virtually all database software, including Oracle and Sybase but most commonly used is freely available MySQL database. Download MySQL for free here − https://www.mysql.com/downloads/\r\n\r\n    PHP Parser − In order to process PHP script instructions a parser must be installed to generate HTML output that can be sent to the Web Browser. This tutorial will guide you how to install PHP parser on your computer.\r\n\r\nPHP Parser Installation\r\n\r\nBefore you proceed it is important to make sure that you have proper environment setup on your machine to develop your web programs using PHP.\r\n\r\nType the following address into your browser's address box.\r\n\r\nhttp://127.0.0.1/info.php\r\n\r\nIf this displays a page showing your PHP installation related information then it means you have PHP and Webserver installed properly. Otherwise you have to follow given procedure to install PHP on your computer.\r\n\r\nThis section will guide you to install and configure PHP over the following four platforms −\r\n\r\n    PHP Installation on Linux or Unix with Apache\r\n\r\n    PHP Installation on Mac OS X with Apache\r\n\r\n    PHP Installation on Windows NT/2000/XP with IIS\r\n\r\n    PHP Installation on Windows NT/2000/XP with Apache\r\n\r\nApache Configuration\r\n\r\nIf you are using Apache as a Web Server then this section will guide you to edit Apache Configuration Files.\r\n\r\nJust Check it here − PHP Configuration in Apache Server\r\nPHP.INI File Configuration\r\n\r\nThe PHP configuration file, php.ini, is the final and most immediate way to affect PHP's functionality.\r\n\r\nJust Check it here − PHP.INI File Configuration\r\nWindows IIS Configuration\r\n\r\nTo configure IIS on your Windows machine you can refer your IIS Reference Manual shipped along with IIS.","lesson_title":"PHP-Environment Setup","lesson_number":2,"_id":{"$oid":"5a491ed6ca8dabec1a6c4ad7"}},{"lesson_body":"his chapter will give you an idea of very basic syntax of PHP and very important to make your PHP foundation strong.\r\nEscaping to PHP\r\n\r\nThe PHP parsing engine needs a way to differentiate PHP code from other elements in the page. The mechanism for doing so is known as 'escaping to PHP'. There are four ways to do this −\r\nCanonical PHP tags\r\n\r\nThe most universally effective PHP tag style is −\r\n\r\n\u003c?php...?\u003e\r\n\r\nIf you use this style, you can be positive that your tags will always be correctly interpreted.\r\nShort-open (SGML-style) tags\r\n\r\nShort or short-open tags look like this −\r\n\r\n\u003c?...?\u003e\r\n\r\nShort tags are, as one might expect, the shortest option You must do one of two things to enable PHP to recognize the tags −\r\n\r\n    Choose the --enable-short-tags configuration option when you're building PHP.\r\n\r\n    Set the short_open_tag setting in your php.ini file to on. This option must be disabled to parse XML with PHP because the same syntax is used for XML tags.\r\n\r\nASP-style tags\r\n\r\nASP-style tags mimic the tags used by Active Server Pages to delineate code blocks. ASP-style tags look like this −\r\n\r\n\u003c%...%\u003e\r\n\r\nTo use ASP-style tags, you will need to set the configuration option in your php.ini file.\r\nHTML script tags\r\n\r\nHTML script tags look like this −\r\n\r\n\u003cscript language = \"PHP\"\u003e...\u003c/script\u003e\r\n\r\nCommenting PHP Code\r\n\r\nA comment is the portion of a program that exists only for the human reader and stripped out before displaying the programs result. There are two commenting formats in PHP −\r\n\r\nSingle-line comments − They are generally used for short explanations or notes relevant to the local code. Here are the examples of single line comments.\r\nMulti-lines comments − They are generally used to provide pseudocode algorithms and more detailed explanations when necessary. The multiline style of commenting is the same as in C. Here are the example of multi lines comments.PHP is whitespace insensitive\r\n\r\nWhitespace is the stuff you type that is typically invisible on the screen, including spaces, tabs, and carriage returns (end-of-line characters).\r\n\r\nPHP whitespace insensitive means that it almost never matters how many whitespace characters you have in a row.one whitespace character is the same as many such characters\r\nStatements are expressions terminated by semicolons\r\n\r\nA statement in PHP is any expression that is followed by a semicolon (;).Any sequence of valid PHP statements that is enclosed by the PHP tags is a valid PHP program. Here is a typical statement in PHP, which in this case assigns a string of characters to a variable called $greeting −\r\n\r\n$greeting = \"Welcome to PHP!\";\r\n\r\nExpressions are combinations of tokens\r\n\r\nThe smallest building blocks of PHP are the indivisible tokens, such as numbers (3.14159), strings (.two.), variables ($two), constants (TRUE), and the special words that make up the syntax of PHP itself like if, else, while, for and so forth\r\nBraces make blocks\r\n\r\nAlthough statements cannot be combined like expressions, you can always put a sequence of statements anywhere a statement can go by enclosing them in a set of curly braces.\r\n\r\nHere both statements are equivalent −\r\n\r\nif (3 == 2 + 1)\r\n   print(\"Good - I haven't totally lost my mind.\u003cbr\u003e\");\r\n   \r\nif (3 == 2 + 1) {\r\n   print(\"Good - I haven't totally\");\r\n   print(\"lost my mind.\u003cbr\u003e\");\r\n}\r\n\r\nRunning PHP Script from Command Prompt\r\n\r\nYes you can run your PHP script on your command prompt. Assuming you have following content in test.php file\r\nLive Demo\r\n\r\n\u003c?php\r\n   echo \"Hello PHP!!!!!\";\r\n?\u003e\r\n\r\nNow run this script as command prompt as follows −\r\n\r\n$ php test.php\r\n\r\nIt will produce the following result −\r\n\r\nHello PHP!!!!!\r\n\r\n","lesson_title":"PHP-Syntax overview","lesson_number":3,"_id":{"$oid":"5a492008ca8dabec1a6c4ad8"}},{"lesson_body":"This session demonstrates how PHP can provide dynamic content according to browser type, randomly generated numbers or User Input. It also demonstrated how the client browser can be redirected.\r\nIdentifying Browser \u0026 Platform\r\n\r\nPHP creates some useful environment variables that can be seen in the phpinfo.php page that was used to setup the PHP environment.\r\n\r\nOne of the environment variables set by PHP is HTTP_USER_AGENT which identifies the user's browser and operating system.\r\n\r\nPHP provides a function getenv() to access the value of all the environment variables. The information contained in the HTTP_USER_AGENT environment variable can be used to create dynamic content appropriate to the browser.\r\nDisplay Images Randomly\r\n\r\nThe PHP rand() function is used to generate a random number.i This function can generate numbers with-in a given range. The random number generator should be seeded to prevent a regular pattern of numbers being generated. This is achieved using the srand() function that specifies the seed number as its argument.\r\nUsing HTML Forms\r\n\r\nThe most important thing to notice when dealing with HTML forms and PHP is that any form element in an HTML page will automatically be available to your PHP scripts.","lesson_title":"PHP-Web Concept","lesson_number":4,"_id":{"$oid":"5a492064ca8dabec1a6c4ad9"}},{"lesson_body":"There are two ways the browser client can send information to the web server.\r\n\r\n    The GET Method\r\n    The POST Method\r\n\r\nBefore the browser sends the information, it encodes it using a scheme called URL encoding. In this scheme, name/value pairs are joined with equal signs and different pairs are separated by the ampersand.\r\n\r\nname1=value1\u0026name2=value2\u0026name3=value3\r\n\r\nSpaces are removed and replaced with the + character and any other nonalphanumeric characters are replaced with a hexadecimal values. After the information is encoded it is sent to the server.\r\nThe GET Method\r\n\r\nThe GET method sends the encoded user information appended to the page request. The page and the encoded information are separated by the ? character.\r\n\r\nhttp://www.test.com/index.htm?name1=value1\u0026name2=value2\r\n\r\n    The GET method produces a long string that appears in your server logs, in the browser's Location: box.\r\n\r\n    The GET method is restricted to send upto 1024 characters only.\r\n\r\n    Never use GET method if you have password or other sensitive information to be sent to the server.\r\n\r\n    GET can't be used to send binary data, like images or word documents, to the server.\r\n\r\n    The data sent by GET method can be accessed using QUERY_STRING environment variable.\r\n\r\n    The PHP provides $_GET associative array to access all the sent information using GET method.\r\nThe POST Method\r\n\r\nThe POST method transfers information via HTTP headers. The information is encoded as described in case of GET method and put into a header called QUERY_STRING.\r\n\r\n    The POST method does not have any restriction on data size to be sent.\r\n\r\n    The POST method can be used to send ASCII as well as binary data.\r\n\r\n    The data sent by POST method goes through HTTP header so security depends on HTTP protocol. By using Secure HTTP you can make sure that your information is secure.\r\n\r\n    The PHP provides $_POST associative array to access all the sent information using POST method.\r\nThe POST Method\r\n\r\nThe POST method transfers information via HTTP headers. The information is encoded as described in case of GET method and put into a header called QUERY_STRING.\r\n\r\n    The POST method does not have any restriction on data size to be sent.\r\n\r\n    The POST method can be used to send ASCII as well as binary data.\r\n\r\n    The data sent by POST method goes through HTTP header so security depends on HTTP protocol. By using Secure HTTP you can make sure that your information is secure.\r\n\r\n    The PHP provides $_POST associative array to access all the sent information using POST method.\r\nThe $_REQUEST variable\r\n\r\nThe PHP $_REQUEST variable contains the contents of both $_GET, $_POST, and $_COOKIE. We will discuss $_COOKIE variable when we will explain about cookies.\r\n\r\nThe PHP $_REQUEST variable can be used to get the result from form data sent with both the GET and POST methods.\r\n","lesson_title":"PHP-Get \u0026 Post","lesson_number":5,"_id":{"$oid":"5a4920b8ca8dabec1a6c4ada"}},{"lesson_body":"We can imagine our universe made of different objects like sun, earth, moon etc. Similarly we can imagine our car made of different objects like wheel, steering, gear etc. Same way there is object oriented programming concepts which assume everything as an object and implement a software using different objects.\r\n\r\n\r\n    The special form class, followed by the name of the class that you want to define.\r\n\r\n    A set of braces enclosing any number of variable declarations and function definitions.\r\n\r\n    Variable declarations start with the special form var, which is followed by a conventional $ variable name; they may also have an initial assignment to a constant value.\r\n\r\n    Function definitions look much like standalone PHP functions but are local to the class and will be used to set and access object data.\r\nCalling Member Functions\r\n\r\nAfter creating your objects, you will be able to call member functions related to that object. One member function will be able to process member variable of related object only.\r\n\r\nFollowing example shows how to set title and prices for the three books by calling member functions.\r\nConstructor Functions\r\n\r\nConstructor Functions are special type of functions which are called automatically whenever an object is created. So we take full advantage of this behaviour, by initializing many things through constructor functions.\r\n\r\nPHP provides a special function called __construct() to define a constructor.\r\nDestructor\r\n\r\nLike a constructor function you can define a destructor function using function __destruct(). You can release all the resources with-in a destructor.","lesson_title":"PHP-Object Oriented Concepts","lesson_number":6,"_id":{"$oid":"5a492158ca8dabec1a6c4adb"}}]}
{"_id":{"$oid":"5a4926b8fb8a10d2c03791f3"},"title":"R Programming","description":"Anyone who works in data science understands the grueling task they sign themselves up for and how much of an ally R Programming language can be when dealing with tons of statistical data. R is becoming a popular language and environment for building cutting-edge scientific algorithms and intelligent analytics applications.","instructor":"Michel Dell","lessons":[{"lesson_body":"R is a programming language and software environment for statistical analysis, graphics representation and reporting. R was created by Ross Ihaka and Robert Gentleman at the University of Auckland, New Zealand, and is currently developed by the R Development Core Team.\r\n\r\nR is freely available under the GNU General Public License, and pre-compiled binary versions are provided for various operating systems like Linux, Windows and Mac.\r\n\r\nThis programming language was named R, based on the first letter of first name of the two R authors (Robert Gentleman and Ross Ihaka), and partly a play on the name of the Bell Labs Language S.R is a programming language and software environment for statistical analysis, graphics representation and reporting. R was created by Ross Ihaka and Robert Gentleman at the University of Auckland, New Zealand, and is currently developed by the R Development Core Team.\r\n\r\nThe core of R is an interpreted computer language which allows branching and looping as well as modular programming using functions. R allows integration with the procedures written in the C, C++, .Net, Python or FORTRAN languages for efficiency.\r\n\r\nR is freely available under the GNU General Public License, and pre-compiled binary versions are provided for various operating systems like Linux, Windows and Mac.\r\n\r\nR is free software distributed under a GNU-style copy left, and an official part of the GNU project called GNU S.\r\nEvolution of R\r\n\r\nR was initially written by Ross Ihaka and Robert Gentleman at the Department of Statistics of the University of Auckland in Auckland, New Zealand. R made its first appearance in 1993.\r\n\r\n    A large group of individuals has contributed to R by sending code and bug reports.\r\n\r\n    Since mid-1997 there has been a core group (the \"R Core Team\") who can modify the R source code archive.\r\n\r\nFeatures of R\r\n\r\nAs stated earlier, R is a programming language and software environment for statistical analysis, graphics representation and reporting. The following are the important features of R −\r\n\r\n    R is a well-developed, simple and effective programming language which includes conditionals, loops, user defined recursive functions and input and output facilities.\r\n\r\n    R has an effective data handling and storage facility,\r\n\r\n    R provides a suite of operators for calculations on arrays, lists, vectors and matrices.\r\n\r\n    R provides a large, coherent and integrated collection of tools for data analysis.\r\n\r\n    R provides graphical facilities for data analysis and display either directly at the computer or printing at the papers.\r\n\r\nAs a conclusion, R is world’s most widely used statistics programming language. It's the # 1 choice of data scientists and supported by a vibrant and talented community of contributors. R is taught in universities and deployed in mission critical business applications. This tutorial will teach you R programming along with suitable examples in simple and easy steps.","lesson_title":"Introduction to R","lesson_number":1,"_id":{"$oid":"5a494a4a7827f824099ac9a3"}},{"lesson_body":"Local Environment Setup\r\n\r\nIf you are still willing to set up your environment for R, you can follow the steps given below.\r\nWindows Installation\r\n\r\nYou can download the Windows installer version of R from R-3.2.2 for Windows (32/64 bit) and save it in a local directory.\r\n\r\nAs it is a Windows installer (.exe) with a name \"R-version-win.exe\". You can just double click and run the installer accepting the default settings. If your Windows is 32-bit version, it installs the 32-bit version. But if your windows is 64-bit, then it installs both the 32-bit and 64-bit versions.\r\n\r\nAfter installation you can locate the icon to run the Program in a directory structure \"R\\R3.2.2\\bin\\i386\\Rgui.exe\" under the Windows Program Files. Clicking this icon brings up the R-GUI which is the R console to do R Programming.\r\nLinux Installation\r\n\r\nR is available as a binary for many versions of Linux at the location R Binaries.\r\n\r\nThe instruction to install Linux varies from flavor to flavor. These steps are mentioned under each type of Linux version in the mentioned link. However, if you are in a hurry, then you can use yum command to install R as follows −\r\n\r\n$ yum install R\r\n\r\nAbove command will install core functionality of R programming along with standard packages, still you need additional package, then you can launch R prompt as follows −Now you can use install command at R prompt to install the required package. For example, the following command will install plotrix package which is required for 3D charts.\r\n\r\n\u003e install.packages(\"plotrix\")","lesson_title":"R - Environment Setup","lesson_number":2,"_id":{"$oid":"5a494a787827f824099ac9a4"}},{"lesson_body":"As a convention, we will start learning R programming by writing a \"Hello, World!\" program. Depending on the needs, you can program either at R command prompt or you can use an R script file to write your program. Let's check both one by one.\r\nR Command Prompt\r\n\r\nOnce you have R environment setup, then it’s easy to start your R command prompt by just typing the following command at your command prompt −\r\n\r\n$ R\r\n\r\nThis will launch R interpreter and you will get a prompt \u003e where you can start typing your program as follows −\r\n\r\n\u003e myString \u003c- \"Hello, World!\"\r\n\u003e print ( myString)\r\n[1] \"Hello, World!\"\r\n\r\nHere first statement defines a string variable myString, where we assign a string \"Hello, World!\" and then next statement print() is being used to print the value stored in variable myString.\r\nR Script File\r\n\r\nUsually, you will do your programming by writing your programs in script files and then you execute those scripts at your command prompt with the help of R interpreter called Rscript. So let's start with writing following code in a text file called test.R as under −\r\n\r\n# My first program in R Programming\r\nmyString \u003c- \"Hello, World!\"\r\n\r\nprint ( myString)\r\n\r\nSave the above code in a file test.R and execute it at Linux command prompt as given below. Even if you are using Windows or other system, syntax will remain same.\r\n\r\n$ Rscript test.R \r\n\r\nWhen we run the above program, it produces the following result.\r\n\r\n[1] \"Hello, World!\"\r\n\r\nComments\r\n\r\nComments are like helping text in your R program and they are ignored by the interpreter while executing your actual program. Single comment is written using # in the beginning of the statement as follows −\r\n\r\n# My first program in R Programming\r\n\r\nR does not support multi-line comments but you can perform a trick which is something as follows −","lesson_title":"R - Basic Syntax","lesson_number":3,"_id":{"$oid":"5a494a9c7827f824099ac9a5"}},{"lesson_body":"A data frame is a table or a two-dimensional array-like structure in which each column contains values of one variable and each row contains one set of values from each column.\r\n\r\nFollowing are the characteristics of a data frame.\r\n\r\n    The column names should be non-empty.\r\n    The row names should be unique.\r\n    The data stored in a data frame can be of numeric, factor or character type.\r\n    Each column should contain same number of data items.\r\nAdd Row\r\n\r\nTo add more rows permanently to an existing data frame, we need to bring in the new rows in the same structure as the existing data frame and use the rbind() function.\r\n\r\nIn the example below we create a data frame with new rows and merge it with the existing data frame to create the final data frame.","lesson_title":"R - Data Frames","lesson_number":4,"_id":{"$oid":"5a494ae27827f824099ac9a6"}},{"lesson_body":"R packages are a collection of R functions, complied code and sample data. They are stored under a directory called \"library\" in the R environment. By default, R installs a set of packages during installation. More packages are added later, when they are needed for some specific purpose. When we start the R console, only the default packages are available by default. Other packages which are already installed have to be loaded explicitly to be used by the R program that is going to use them.\r\n\r\nAll the packages available in R language are listed at R Packages.\r\n\r\nBelow is a list of commands to be used to check, verify and use the R packages.\r\nCheck Available R Packages\r\n\r\nGet library locations containing R packages\r\n\r\n.libPaths()\r\n\r\nWhen we execute the above code, it produces the following result. It may vary depending on the local settings of your pc.\r\n\r\n[2] \"C:/Program Files/R/R-3.2.2/library\"\r\n\r\nGet the list of all the packages installed\r\n\r\nlibrary()\r\n\r\nWhen we execute the above code, it produces the following result. It may vary depending on the local settings of your pc.\r\n\r\nPackages in library ‘C:/Program Files/R/R-3.2.2/library’:\r\n\r\nbase                    The R Base Package\r\nboot                    Bootstrap Functions (Originally by Angelo Canty\r\n                        for S)\r\nclass                   Functions for Classification\r\ncluster                 \"Finding Groups in Data\": Cluster Analysis\r\n                        Extended Rousseeuw et al.\r\ncodetools               Code Analysis Tools for R\r\ncompiler                The R Compiler Package\r\n\r\nGet all packages currently loaded in the R environment\r\n\r\nsearch()\r\n\r\nWhen we execute the above code, it produces the following result. It may vary depending on the local settings of your pc.\r\n\r\n[1] \".GlobalEnv\"        \"package:stats\"     \"package:graphics\" \r\n[4] \"package:grDevices\" \"package:utils\"     \"package:datasets\" \r\n[7] \"package:methods\"   \"Autoloads\"         \"package:base\" \r\n\r\nInstall a New Package\r\n\r\nThere are two ways to add new R packages. One is installing directly from the CRAN directory and another is downloading the package to your local system and installing it manually.\r\nInstall directly from CRAN\r\n\r\nThe following command gets the packages directly from CRAN webpage and installs the package in the R environment. You may be prompted to choose a nearest mirror. Choose the one appropriate to your location.\r\n\r\n install.packages(\"Package Name\")\r\n \r\n# Install the package named \"XML\".\r\n install.packages(\"XML\")\r\n\r\nInstall package manually\r\n\r\nGo to the link R Packages to download the package needed. Save the package as a .zip file in a suitable location in the local system.\r\n\r\nNow you can run the following command to install this package in the R environment.\r\n\r\ninstall.packages(file_name_with_path, repos = NULL, type = \"source\")\r\n\r\n# Install the package named \"XML\"\r\ninstall.packages(\"E:/XML_3.98-1.3.zip\", repos = NULL, type = \"source\")\r\n\r\nLoad Package to Library\r\n\r\nBefore a package can be used in the code, it must be loaded to the current R environment. You also need to load a package that is already installed previously but not available in the current environment.\r\n\r\nA package is loaded using the following command −\r\n\r\nlibrary(\"package Name\", lib.loc = \"path to library\")\r\n\r\n# Load the package named \"XML\"\r\ninstall.packages(\"E:/XML_3.98-1.3.zip\", repos = NULL, type = \"source\")\r\n","lesson_title":"R - Packages","lesson_number":5,"_id":{"$oid":"5a494b037827f824099ac9a7"}},{"lesson_body":"he data is Relational database systems are stored in a normalized format. So, to carry out statistical computing we will need very advanced and complex Sql queries. But R can connect easily to many relational databases like MySql, Oracle, Sql server etc. and fetch records from them as a data frame. Once the data is available in the R environment, it becomes a normal R data set and can be manipulated or analyzed using all the powerful packages and functions.\r\n\r\nIn this tutorial we will be using MySql as our reference database for connecting to R.\r\nRMySQL Package\r\n\r\nR has a built-in package named \"RMySQL\" which provides native connectivity between with MySql database. You can install this package in the R environment using the following command.\r\n\r\ninstall.packages(\"RMySQL\")\r\n\r\nConnecting R to MySql\r\n\r\nOnce the package is installed we create a connection object in R to connect to the database. It takes the username, password, database name and host name as input.\r\n\r\n# Create a connection Object to MySQL database.\r\n# We will connect to the sampel database named \"sakila\" that comes with MySql installation.\r\nmysqlconnection = dbConnect(MySQL(), user = 'root', password = '', dbname = 'sakila',\r\n   host = 'localhost')\r\n\r\n# List the tables available in this database.\r\n dbListTables(mysqlconnection)","lesson_title":"R - Databases","lesson_number":6,"_id":{"$oid":"5a494b357827f824099ac9a8"}},{"lesson_body":"Scatterplots show many points plotted in the Cartesian plane. Each point represents the values of two variables. One variable is chosen in the horizontal axis and another in the vertical axis.\r\n\r\nThe simple scatterplot is created using the plot() function.\r\nSyntax\r\n\r\nThe basic syntax for creating scatterplot in R is −\r\n\r\nplot(x, y, main, xlab, ylab, xlim, ylim, axes)\r\n\r\nFollowing is the description of the parameters used −\r\n\r\n    x is the data set whose values are the horizontal coordinates.\r\n\r\n    y is the data set whose values are the vertical coordinates.\r\n\r\n    main is the tile of the graph.\r\n\r\n    xlab is the label in the horizontal axis.\r\n\r\n    ylab is the label in the vertical axis.\r\n\r\n    xlim is the limits of the values of x used for plotting.\r\n\r\n    ylim is the limits of the values of y used for plotting.\r\n\r\n    axes indicates whether both axes should be drawn on the plot.\r\ncatterplot Matrices\r\n\r\nWhen we have more than two variables and we want to find the correlation between one variable versus the remaining ones we use scatterplot matrix. We use pairs() function to create matrices of scatterplots.\r\nSyntax\r\n\r\nThe basic syntax for creating scatterplot matrices in R is −\r\n\r\npairs(formula, data)\r\n\r\nFollowing is the description of the parameters used −\r\n\r\n    formula represents the series of variables used in pairs.\r\n\r\n    data represents the data set from which the variables will be taken.\r\n","lesson_title":"R - Scatterplots","lesson_number":7,"_id":{"$oid":"5a494b6c7827f824099ac9a9"}},{"lesson_body":"In R, we can read data from files stored outside the R environment. We can also write data into files which will be stored and accessed by the operating system. R can read and write into various file formats like csv, excel, xml etc.\r\n\r\nIn this chapter we will learn to read data from a csv file and then write data into a csv file. The file should be present in current working directory so that R can read it. Of course we can also set our own directory and read files from there.\r\nGetting and Setting the Working Directory\r\n\r\nYou can check which directory the R workspace is pointing to using the getwd() function. You can also set a new working directory using setwd()function.\r\n\r\n# Get and print current working directory.\r\nprint(getwd())\r\n\r\n# Set current working directory.\r\nsetwd(\"/web/com\")\r\n\r\n# Get and print current working directory.\r\nprint(getwd())\r\n\r\nWhen we execute the above code, it produces the following result −\r\n\r\n[1] \"/web/com/1441086124_2016\"\r\n[1] \"/web/com\"\r\n\r\nThis result depends on your OS and your current directory where you are working.\r\nInput as CSV File\r\n\r\nThe csv file is a text file in which the values in the columns are separated by a comma. Let's consider the following data present in the file named input.csv.\r\n\r\nYou can create this file using windows notepad by copying and pasting this data. Save the file as input.csv using the save As All files(*.*) option in notepad.\r\n\r\nid,name,salary,start_date,dept\r\n1,Rick,623.3,2012-01-01,IT\r\n2,Dan,515.2,2013-09-23,Operations\r\n3,Michelle,611,2014-11-15,IT\r\n4,Ryan,729,2014-05-11,HR\r\n ,Gary,843.25,2015-03-27,Finance\r\n6,Nina,578,2013-05-21,IT\r\n7,Simon,632.8,2013-07-30,Operations\r\n8,Guru,722.5,2014-06-17,Finance\r\n\r\nReading a CSV File\r\n\r\nFollowing is a simple example of read.csv() function to read a CSV file available in your current working directory −\r\n\r\ndata \u003c- read.csv(\"input.csv\")\r\nprint(data)","lesson_title":"R - CSV Files","lesson_number":8,"_id":{"$oid":"5a494bb67827f824099ac9aa"}}]}
{"_id":{"$oid":"5a49280ffb8a10d2c03791f4"},"title":"Digital Marketing","description":"This course also covers Affiliate Marketing and you will learn how can you earn lot of money by selling different products as an affiliate. You will also learn Email Marketing, Analytics, Content marketing and setting up G+ accounts for the business. Learn all this and much more with the amazing and easy to follow course structure. So join now and start selling..","instructor":"Shyam Krishna","lessons":[{"lesson_body":"Marketing of products and services through the use of digital technologies, mainly through the internet, including mobile phones and other digital medium falls under the umbrella of digital marketing. This tutorial explains how you can use popular social media platforms such as Facebook, Twitter, LinkedIn, and Google+ to promote your business and create greater awareness about the products and services you offer.In simple terms, digital marketing is the promotion of products or brands via one or more forms of electronic media. Digital marketing is often referred to as online marketing, internet marketing or web marketing.\r\n\r\nDigital marketing has been around for quite some time but it hasn’t been very well defined. We tend to think that digital marketing encompasses banner advertising, search engine optimization (SEO) and pay per click. Yet, this is too narrow a definition, because digital marketing also includes e-mail, RSS, voice broadcast, fax broadcast, blogging, podcasting, video streams, wireless text messaging, and instant messaging. Yes! digital marketing has a very wide scope.Why Digital Marketing?\r\n\r\nIn digital marketing, a reporting and analytics engine can be layered within a campaign which allows the organization or brand to monitor in real-time how a campaign is performing, such as what is being viewed, how often, how long, as well as other actions such as response rates and purchases made.\r\n\r\n    The use of digital marketing in the digital era not only allows for brands to market their products and services but also offers online customer support through 24x7 services to make the customer feel supported and valued.\r\n\r\n    The use of social media in digital marketing interaction allows brands to receive both positive and negative feedback from their customers as well as determine what media platforms work well for them.\r\n\r\n    Digital marketing provides increased advantage for brands and businesses. It is now common for consumers to post feedback online through social media sources, blogs, and websites about their experience with a product or brand.\r\n\r\nNot surprisingly, billions of marketing dollars spent on traditional channels is already starting to shift to digital marketing campaigns and this will continue to increase as the Web matures.","lesson_title":"Introduction to Digital Marketing","lesson_number":1,"_id":{"$oid":"5a493a047827f824099ac975"}},{"lesson_body":"SEO stands for Search Engine Optimization. It is the process of getting traffic from the free, organic, editorial, or natural search results on the search engines. Simply put, it’s the name given to the activity that attempts to improve search engine rankings. In many respects, it's simply quality control for websites.\r\n\r\nSEO may target different kinds of search, including image search, local search, video search, and news search engines. Employing a sound SEO strategy will help you position your website properly to be found at the most critical points in the buying process or when people need your site.\r\nSearch Engine Crawlers\r\n\r\nThe leading search engines, such as Google, Bing and Yahoo!, use crawlers to find the pages for their algorithmic search results. Pages that are linked from other search engine indexed pages do not need to be submitted because they are found automatically.\r\n\r\nSearch engine crawlers may look at a number of different factors when crawling a site. Not every page is indexed by the search engines. Distance of pages from the root directory of a site may also be a factor in whether or not pages get crawled.\r\n\r\n\r\n    Search engines want to do their jobs as best as possible by referring users to websites and content that is most relevant to what the user is looking for. This is determined by the site content, how fast your site loads, how often your site is linked to from other credible online resources, and user experience, including design, navigation and bounce rate.\r\n\r\n    The items that the search engines don’t want are: keyword stuffing, buying links, and poor user experience (too many ads and high bounce rates).\r\n\r\n    Domain naming is important to your overall branding. As a best practice, use sub-directory root domains (example.com/events) versus sub-domains (events.example.com). Other best practices with domain names are to use consistent domains and keywords in the URL.\r\n\r\n    Optimize for different types of results. In addition to optimizing for desktop experience, focus on mobile and tablet optimization along with other media.\r\n\r\n    Content on the site should have title tags and meta descriptions. Although meta tags aren’t as important as they used to be in the past; if you do use them, ensure they are formatted correctly.\r\n","lesson_title":"Digital Marketing - SEO","lesson_number":2,"_id":{"$oid":"5a493a467827f824099ac976"}},{"lesson_body":"Pay Per Click, commonly known as PPC, refers to a model of internet marketing in which advertisers pay a fee each time one of their ads is clicked. Pay-per-click is calculated by dividing the advertising cost by the number of clicks generated by an advertisement. The basic formula is −\r\n\r\nPay-per-click ($) = Advertising cost ($) ÷ Ads clicked (#)\r\n\r\nEssentially, PPC is a way of buying visits to your site, rather than attempting to earn visits organically.\r\nSearch Engine Advertising\r\n\r\nSearch engine advertising is one of the most popular forms of PPC. It allows advertisers to bid for an ad placement in a search engine's sponsored links when someone searches using a keyword that is related to their business offering.For example, if you bid on the keyword “marketing classes,” several ads might show up in the very top spot on the Google results page. Every time a specific ad is clicked, sending a visitor to their website, they have to pay the search engine a small fee. When PPC is working correctly, the fee is trivial, because the visit is worth more than what is paid for it.Advantage of PPC Marketing\r\n\r\nThe unique advantage of PPC marketing is that the ad networks used to manage PPC campaigns don’t just reward the highest bidders for that ad space, rather they reward the highest-quality ads (meaning the ads that are most popular with the users).\r\n\r\n    Ads are rewarded for good performance.\r\n\r\n    The better the ad, the greater the click-through rates and lower the costs.\r\n\r\n    Many marketers choose to use Google AdWords to manage their PPC campaigns. The AdWords platform enables businesses to create ads that appear on Google’s search engine and other Google properties.\r\n\r\nFactors behind Successful PPC Advertising\r\n\r\nHow often your PPC ads appear depends on which keywords and match types you select. While a number of factors determine how successful your PPC advertising campaign will be, you can achieve a lot by focusing on −\r\n\r\n    Keyword Relevance − Crafting relevant PPC keyword lists, tight keyword groups, and proper ad text.\r\n\r\n    Landing Page Quality − Creating optimized landing pages with persuasive, relevant content and a clear call-to-action, tailored to specific search queries.\r\n\r\n    Quality Score − Quality Score is Google's rating of the quality and relevance of your keywords, landing pages, and PPC campaigns. Advertisers with better quality scores get more ad clicks at lower costs.\r\n\r\nYour entire PPC campaign is built around keywords, and the most successful AdWords advertisers continuously grow and refine their PPC keyword list.\r\n\r\nIn conclusion, PPC advertising offers a unique opportunity to −\r\n\r\n    Grow Your Customer Base − Connect with searchers actively looking for products and services like yours, and respond to the need by providing them with an offer relevant to their search query.\r\n\r\n    Generate Leads at Low Costs − As pay-per-click marketing allows you to reach leads and prospects when they’re researching and looking to buy, it’s a highly effective way to bring interested visitors to your site. In addition, you can enjoy an algorithmically generated discount from the search engines in exchange for making their users happy.\r\n","lesson_title":"Digital Marketing - Pay Per Click","lesson_number":3,"_id":{"$oid":"5a493a8d7827f824099ac977"}},{"lesson_body":"Web Analytics is the measurement, collection, analysis, and reporting of Internet data for the purposes of understanding and optimizing Web usage.\r\n\r\nThe focus of web analytics is to understand the users of a site, their behavior, and activities. The study of online user behavior and activities generate valuable marketing intelligence and provides −\r\n\r\n    Performance measures of the website against targets.\r\n\r\n    Insight on user behaviors and needs, and how the site meets those needs.\r\n\r\n    Optimization ability to make modifications to improve the website based on the results.\r\nWeb Analytics Tools\r\n\r\nAn average web analytics tool offers hundreds of metrics. All of them are interesting but only a few would be useful for measuring the website’s performance. Focus on what is important to get meaningful insights on your website, and start your web analytics initiative by defining realistic and measurable objectives for your site.\r\n\r\n    In order to identify the users, web analytics tools need to report on user sessions (also referred to as visits). There are different techniques to identify users such as IP addresses, user agent and IP address combination, cookies, and authenticated user.\r\n\r\n    Nowadays, the most common user identification technique is via cookies which are small packets of data that are usually deposited on the user’s computer hard disk when the person visits a website.\r\n\r\nHow to Review Web Metrics\r\n\r\nWhen reviewing metrics, there are a few things to keep in mind to ensure you are encompassing the set of data that best evaluates your efficiency −\r\nThink People and Process\r\n\r\nNo doubt, technology is important, but you need to go beyond it. Take time and care to thoroughly understand your stakeholders’ measurement needs.\r\nSegmentation\r\n\r\nThere’s more to data than just total number of page views. Many organizations unfortunately still report on total page views and miss out on all the non-page view interactions such as video, downloads and rich media.\r\n\r\nAnalytics platforms such as Google Analytics, MixPanel, Flurry and others, are very powerful and allow us the ability to go beyond simplistic hit collection, and really dive into rich data and patterns.\r\n\r\nYou can easily report and derive insights with visitor segmentation, have quick visibility into buyer or non-buyer behavior, group content by asset type, measure gated or ungated content consumption, and with relatively ease run a cohort analysis. These are just a few views that could be utilized while segmenting your data.\r\nThink Visitors, Not Visits\r\n\r\nExplore data such as where visitors came from, what course they took between pages while on your website, and where they spent the most (or least) time during their visit. Later, after two or three visits they got converted to customers. With this information, you’re able to gain increased awareness of visitors and how they interact with your content throughout the buying cycle.\r\nOptimize What Matters Most\r\n\r\nOptimize conversions on all things digital. Take it one notch higher and optimize on the Lifetime Value of a customer. Put into place a system that gives you the ability to measure behavior and interaction across multi-devices and multiple channels for (most) users that come from mobile, web, etc.\r\nMaximize Returns\r\n\r\nYou’ll maximize the return on gathering, reporting and analyzing data, when you do so consistently. Commit to the process and develop a list of priorities and a measurement “roadmap.” Audit what you have periodically. Websites and mobile apps are constantly evolving, so ensure your analytics implementation is in-line with such changes.","lesson_title":"Digital Marketing - Web Analytics","lesson_number":4,"_id":{"$oid":"5a493abd7827f824099ac978"}},{"lesson_body":"CRO stands for Conversion Rate Optimization. Whatever may be the ultimate goal of your website, a conversion is the successful completion of that action. CRO is the process of optimizing the site to increase the likelihood that visitors will complete a specific action.\r\n\r\nConversion Rate is a key metric in e-commerce, as it reveals the percentage of the site’s total traffic completing a specific goal. The higher the conversion rate, the better.Once you have defined what conversions you want to track, you can calculate the conversion rate.\r\n\r\nLet’s assume you regard a sale as your conversion. As long as you are tracking the number of leads you get and the number of resulting sales (conversions), you can calculate your conversion rate −\r\n\r\n$$Conversion Rate = \\frac{Total Number of Sales }{Number of Leads} \\times 100$$\r\n\r\nWhen you know what the value of a lead is, you can determine how many leads you need each month to sustain your business and how much you should pay for advertising. This is true whether you are using pay-per-click (PPC) or any offline advertising like mailers or print ads.What is CRO?\r\n\r\nConversion Rate Optimization is −\r\n\r\n    A structured and systematic approach to improving the performance of the website.\r\n\r\n    Informed by insights − specifically, analytics and user feedback.\r\n\r\n    Defined by the website’s unique objectives and needs (KPIs).\r\n\r\n    Taking the traffic that you already have and making the most of it.\r\n\r\nWhat CRO is Not\r\n\r\nConversion Rate Optimization is not −\r\n\r\n    Based on the guesses, hunches, or what everyone else is doing.\r\n\r\n    Driven by the highest paid person’s opinion.\r\n\r\n    About getting as many users as possible, regardless of the quality or engagement.\r\n\r\nWhy do Companies Use CRO?\r\n\r\nCRO plays an important role in improving the efficiency of critical processes. Here, we will discuss the most common areas where companies evaluate CRO.\r\n\r\n    A/B testing − What is A/B testing? In basic terms, you set up two different landing pages, each has a different element from the other. Your site presents the “A” version of these pages to half your traffic and the “B” version to the remaining half. Then you can see whether or not a small change to a call-to-action (CTA) can make a difference in conversion rates.\r\n\r\n    Customer Journey Analysis − How did your customers progress from brand awareness to purchase? Also often referred to as a Conversion Funnel.\r\n\r\n    Cart abandonment analysis − Investigate the cause of not checking out, once the items have been added to a shopping cart.\r\n\r\n    Segmentation − Segmentation shows approaches to grouping prospects and customers to deliver more relevant communications and offers for better response rates to these communications.\r\n","lesson_title":"Digital Marketing - CRO","lesson_number":5,"_id":{"$oid":"5a493b7c7827f824099ac979"}},{"lesson_body":"LinkedIn can be a powerful tool for individuals and companies looking to make new connections, generate leads, and build their brand. In addition to being a great way to recruit new talent, LinkedIn marketing is a likely top marketing tool to employ for B2B businesses. It consistently proves to be the platform of choice for marketing product launches and lead generation.A comprehensive LinkedIn marketing strategy requires ongoing management, monitoring, analysis, and adjustments.\r\n\r\nHere, we have listed down a set of important tips to help you get the most out of your LinkedIn Marketing strategy −\r\nCreate a dynamic company page for your brand\r\n\r\nTo create a business presence on LinkedIn and gain access to additional features that enhance your visibility, you must build a LinkedIn company page. Consider this page an extension of your website and fill out the complete profile, including products and services. Invite your employees and customers to follow the page.\r\nBe an authority in your industry\r\n\r\nYou need to plan out what type of content you can provide that will have decision-makers thinking twice about the approaches they're taking. Think about the discussions you can create that make you stand out as a thought leader. Also determine whether the content is relevant and for whom, and whether the content inspires prospects to want to take action.\r\nEngage in the community\r\n\r\nIt's not about how many connections you make or followers you have on LinkedIn and other social media platforms. It's about how many people you reach and engage with. The best way to engage in social media is to create a community.\r\n\r\nIn LinkedIn, you can create actual groups that you manage. Consider taking an active role and creating a group in the industry that you are active in. Or, simply join an existing group and share the relevant content. Either way, you’ll be creating new contacts and participating in worthwhile conversations with industry leaders in your field.View the stats\r\n\r\nThe new LinkedIn Publisher stats offer amazing insight into not only how many people are viewing each post, but the lifespan of each post, reader demographics, and the people who engage with your posts.\r\n\r\nTo see your stats, go to the Who’s Viewed Your Posts tab, which is located under Profile in the main navigation under Who’s Viewed Your Profile. Click on any post to see a graph that shows the number of views in the last 7 days, 15 days, 30 days, 6 months or 1 year.\r\n\r\nThis gives you incredible perspective to see the shelf life of each post. Review these numbers, as well as the elements of the posts themselves, to see patterns that will tell you what topics, format, and length your readers are most interested in.","lesson_title":"Digital Marketing - Linkedin","lesson_number":6,"_id":{"$oid":"5a493be97827f824099ac97a"}}]}
{"_id":{"$oid":"5a4928e5fb8a10d2c03791f5"},"title":"NodeJS","description":"Do you want to code for the web? In this course: get a fundamental introduction to a fast growing JavaScript environment.Node.js is a runtime environment that allows you to use JavaScript outside of a browser context. For instance, you can use it directly on a computer or server OS. It has support for HTTP and reading from/writing to files. Node.js is lightweight and efficient.","instructor":"John Bura","lessons":[{"lesson_body":"Node.js is a very powerful JavaScript-based framework/platform built on Google Chrome's JavaScript V8 Engine. It is used to develop I/O intensive web applications like video streaming sites, single-page applications, and other web applications. Node.js is open source, completely free, and used by thousands of developers around the world.Before proceeding with this tutorial, you should have a basic understanding of JavaScript. As we are going to develop web-based applications using Node.js, it will be good if you have some understanding of other web technologies such as HTML, CSS, AJAX, etc./* Hello World! program in Node.js */\r\nconsole.log(\"Hello World!\");","lesson_title":"Introduction to NodeJs","lesson_number":1,"_id":{"$oid":"5a4941a27827f824099ac989"}},{"lesson_body":"Node.js is a server-side platform built on Google Chrome's JavaScript Engine (V8 Engine). Node.js was developed by Ryan Dahl in 2009 and its latest version is v0.10.36. The definition of Node.js as supplied by its official documentation is as follows −\r\n\r\n    Node.js is a platform built on Chrome's JavaScript runtime for easily building fast and scalable network applications. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.\r\n\r\nNode.js is an open source, cross-platform runtime environment for developing server-side and networking applications. Node.js applications are written in JavaScript, and can be run within the Node.js runtime on OS X, Microsoft Windows, and Linux.\r\n\r\nNode.js also provides a rich library of various JavaScript modules which simplifies the development of web applications using Node.js to a great extent.\r\n\r\nNode.js = Runtime Environment + JavaScript Library\r\n\r\nFeatures of Node.js\r\n\r\nFollowing are some of the important features that make Node.js the first choice of software architects.\r\n\r\n    Asynchronous and Event Driven − All APIs of Node.js library are asynchronous, that is, non-blocking. It essentially means a Node.js based server never waits for an API to return data. The server moves to the next API after calling it and a notification mechanism of Events of Node.js helps the server to get a response from the previous API call.\r\n\r\n    Very Fast − Being built on Google Chrome's V8 JavaScript Engine, Node.js library is very fast in code execution.\r\n\r\n    Single Threaded but Highly Scalable − Node.js uses a single threaded model with event looping. Event mechanism helps the server to respond in a non-blocking way and makes the server highly scalable as opposed to traditional servers which create limited threads to handle requests. Node.js uses a single threaded program and the same program can provide service to a much larger number of requests than traditional servers like Apache HTTP Server.\r\n\r\n    No Buffering − Node.js applications never buffer any data. These applications simply output the data in chunks.\r\n\r\n    License − Node.js is released under the MIT license.\r\nWho Uses Node.js?\r\n\r\nFollowing is the link on github wiki containing an exhaustive list of projects, application and companies which are using Node.js. This list includes eBay, General Electric, GoDaddy, Microsoft, PayPal, Uber, Wikipins, Yahoo!, and Yammer to name a few.\r\n\r\n    Projects, Applications, and Companies Using Node\r\nWhere to Use Node.js?\r\n\r\nFollowing are the areas where Node.js is proving itself as a perfect technology partner.\r\n\r\n    I/O bound Applications\r\n\r\n    Data Streaming Applications\r\n\r\n    Data Intensive Real-time Applications (DIRT)\r\n\r\n    JSON APIs based Applications\r\n\r\n    Single Page Applications\r\n\r\nWhere Not to Use Node.js?\r\n\r\nIt is not advisable to use Node.js for CPU intensive applications.","lesson_title":"What is Nodejs?","lesson_number":2,"_id":{"$oid":"5a4941f07827f824099ac98a"}},{"lesson_body":"Local Environment Setup\r\n\r\nIf you are still willing to set up your environment for Node.js, you need the following two softwares available on your computer, (a) Text Editor and (b) The Node.js binary installables.\r\nText Editor\r\n\r\nThis will be used to type your program. Examples of few editors include Windows Notepad, OS Edit command, Brief, Epsilon, EMACS, and vim or vi.\r\n\r\nName and version of text editor can vary on different operating systems. For example, Notepad will be used on Windows, and vim or vi can be used on windows as well as Linux or UNIX.\r\n\r\nThe files you create with your editor are called source files and contain program source code. The source files for Node.js programs are typically named with the extension \".js\".\r\n\r\nBefore starting your programming, make sure you have one text editor in place and you have enough experience to write a computer program, save it in a file, and finally execute it.\r\nThe Node.js Runtime\r\n\r\nThe source code written in source file is simply javascript. The Node.js interpreter will be used to interpret and execute your javascript code.\r\n\r\nNode.js distribution comes as a binary installable for SunOS , Linux, Mac OS X, and Windows operating systems with the 32-bit (386) and 64-bit (amd64) x86 processor architectures.\r\n\r\nFollowing section guides you on how to install Node.js binary distribution on various OS.\r\nDownload Node.js archive\r\n\r\nDownload latest version of Node.js installable archive file from Node.js Downloads. At the time of writing this tutorial, following are the versions available on different OS.nstallation on Windows\r\n\r\nUse the MSI file and follow the prompts to install the Node.js. By default, the installer uses the Node.js distribution in C:\\Program Files\\nodejs. The installer should set the C:\\Program Files\\nodejs\\bin directory in window's PATH environment variable. Restart any open command prompts for the change to take effect.erify installation: Executing a File\r\n\r\nCreate a js file named main.js on your machine (Windows or Linux) having the following code.\r\n\r\n/* Hello, World! program in node.js */\r\nconsole.log(\"Hello, World!\")\r\n\r\nNow execute main.js file using Node.js interpreter to see the result:\r\n\r\n$ node main.js\r\n\r\nIf everything is fine with your installation, this should produce the following result:\r\n\r\nHello, World!\r\n","lesson_title":"Node.js - Environment Setup","lesson_number":3,"_id":{"$oid":"5a4942217827f824099ac98b"}},{"lesson_body":"REPL stands for Read Eval Print Loop and it represents a computer environment like a Windows console or Unix/Linux shell where a command is entered and the system responds with an output in an interactive mode. Node.js or Node comes bundled with a REPL environment. It performs the following tasks −\r\n\r\n    Read − Reads user's input, parses the input into JavaScript data-structure, and stores in memory.\r\n\r\n    Eval − Takes and evaluates the data structure.\r\n\r\n    Print − Prints the result.\r\n\r\n    Loop − Loops the above command until the user presses ctrl-c twice.\r\n\r\nThe REPL feature of Node is very useful in experimenting with Node.js codes and to debug JavaScript codes.\r\nOnline REPL Terminal\r\n\r\nTo simplify your learning, we have set up an easy to use Node.js REPL environment online, where you can practice Node.js syntax − Launch Node.js REPL Terminal\r\nStarting REPL\r\n\r\nREPL can be started by simply running node on shell/console without any arguments as follows.\r\n\r\n$ node\r\n\r\nYou will see the REPL Command prompt \u003e where you can type any Node.js command −\r\n\r\n$ node\r\n\u003e\r\nUse Variables\r\n\r\nYou can make use variables to store values and print later like any conventional script. If var keyword is not used, then the value is stored in the variable and printed. Whereas if var keyword is used, then the value is stored but not printed. You can print variables using console.log().Multiline Expression\r\n\r\nNode REPL supports multiline expression similar to JavaScript. Let's check the following do-while loop in action −REPL Commands\r\n\r\n    ctrl + c − terminate the current command.\r\n\r\n    ctrl + c twice − terminate the Node REPL.\r\n\r\n    ctrl + d − terminate the Node REPL.\r\n\r\n    Up/Down Keys − see command history and modify previous commands.\r\n\r\n    tab Keys − list of current commands.\r\n\r\n    .help − list of all commands.\r\n\r\n    .break − exit from multiline expression.\r\n\r\n    .clear − exit from multiline expression.\r\n\r\n    .save filename − save the current Node REPL session to a file.\r\n\r\n    .load filename − load file content in current Node REPL session.\r\nStopping REPL\r\n\r\nAs mentioned above, you will need to use ctrl-c twice to come out of Node.js REPL.","lesson_title":"Node.js - REPL Terminal","lesson_number":4,"_id":{"$oid":"5a4942627827f824099ac98c"}},{"lesson_body":"Node Package Manager (NPM) provides two main functionalities −\r\n\r\n    Online repositories for node.js packages/modules which are searchable on search.nodejs.org\r\n\r\n    Command line utility to install Node.js packages, do version management and dependency management of Node.js packages.\r\n\r\nNPM comes bundled with Node.js installables after v0.6.3 version. To verify the same, open console and type the following command and see the result −\r\n\r\n$ npm --version\r\n2.7.1\r\n\r\nIf you are running an old version of NPM then it is quite easy to update it to the latest version. Just use the following command from root −\r\n\r\n$ sudo npm install npm -g\r\n/usr/bin/npm -\u003e /usr/lib/node_modules/npm/bin/npm-cli.js\r\nnpm@2.7.1 /usr/lib/node_modules/npm\r\n\r\nInstalling Modules using NPM\r\n\r\nThere is a simple syntax to install any Node.js module −\r\n\r\n$ npm install \u003cModule Name\u003e\r\n\r\nFor example, following is the command to install a famous Node.js web framework module called express −\r\n\r\n$ npm install express\r\n\r\nNow you can use this module in your js file as following −\r\n\r\nvar express = require('express');\r\n\r\nGlobal vs Local Installation\r\n\r\nBy default, NPM installs any dependency in the local mode. Here local mode refers to the package installation in node_modules directory lying in the folder where Node application is present. Locally deployed packages are accessible via require() method. For example, when we installed express module, it created node_modules directory in the current directory where it installed the express module.\r\n\r\n$ ls -l\r\ntotal 0\r\ndrwxr-xr-x 3 root root 20 Mar 17 02:23 node_modules\r\n\r\nAlternatively, you can use npm ls command to list down all the locally installed modules.\r\n\r\nGlobally installed packages/dependencies are stored in system directory. Such dependencies can be used in CLI (Command Line Interface) function of any node.js but cannot be imported using require() in Node application directly. Now let's try installing the express module using global installation.\r\n\r\n$ npm install express -g\r\n\r\nThis will produce a similar result but the module will be installed globally. Here, the first line shows the module version and the location where it is getting installed.Using package.json\r\n\r\npackage.json is present in the root directory of any Node application/module and is used to define the properties of a package. Let's open package.json of express package present in node_modules/express/.You will need to provide all the required information about your module. You can take help from the above-mentioned package.json file to understand the meanings of various information demanded. Once package.json is generated, use the following command to register yourself with NPM repository site using a valid email address.","lesson_title":"Node Package Manager (NPM) ","lesson_number":5,"_id":{"$oid":"5a4942a97827f824099ac98d"}},{"lesson_body":"Callback is an asynchronous equivalent for a function. A callback function is called at the completion of a given task. Node makes heavy use of callbacks. All the APIs of Node are written in such a way that they support callbacks.\r\n\r\nFor example, a function to read a file may start reading file and return the control to the execution environment immediately so that the next instruction can be executed. Once file I/O is complete, it will call the callback function while passing the callback function, the content of the file as a parameter. So there is no blocking or wait for File I/O. This makes Node.js highly scalable, as it can process a high number of requests without waiting for any function to return results.These two examples explain the concept of blocking and non-blocking calls.\r\n\r\n    The first example shows that the program blocks until it reads the file and then only it proceeds to end the program.\r\n\r\n    The second example shows that the program does not wait for file reading and proceeds to print \"Program Ended\" and at the same time, the program without blocking continues reading the file.\r\n\r\nThus, a blocking program executes very much in sequence. From the programming point of view, it is easier to implement the logic but non-blocking programs do not execute in sequence. In case a program needs to use any data to be processed, it should be kept within the same block to make it sequential execution.","lesson_title":"Node.js - Callback","lesson_number":6,"_id":{"$oid":"5a4942f07827f824099ac98e"}},{"lesson_body":"Express is a minimal and flexible Node.js web application framework that provides a robust set of features to develop web and mobile applications. It facilitates the rapid development of Node based Web applications. Following are some of the core features of Express framework −\r\n\r\n    Allows to set up middlewares to respond to HTTP Requests.\r\n\r\n    Defines a routing table which is used to perform different actions based on HTTP Method and URL.\r\n\r\n    Allows to dynamically render HTML Pages based on passing arguments to templates.\r\n\r\nInstalling Express\r\n\r\nFirstly, install the Express framework globally using NPM so that it can be used to create a web application using node terminal.\r\n\r\n$ npm install express --save\r\n\r\nThe above command saves the installation locally in the node_modules directory and creates a directory express inside node_modules. You should install the following important modules along with express −\r\n\r\n    body-parser − This is a node.js middleware for handling JSON, Raw, Text and URL encoded form data.\r\n\r\n    cookie-parser − Parse Cookie header and populate req.cookies with an object keyed by the cookie names.\r\n\r\n    multer − This is a node.js middleware for handling multipart/form-data.\r\nRequest \u0026 Response\r\n\r\nExpress application uses a callback function whose parameters are request and response objects.\r\n\r\n    Request Object − The request object represents the HTTP request and has properties for the request query string, parameters, body, HTTP headers, and so on.\r\n\r\n    Response Object − The response object represents the HTTP response that an Express app sends when it gets an HTTP request.\r\n\r\nYou can print req and res objects which provide a lot of information related to HTTP request and response including cookies, sessions, URL, etc.\r\nBasic Routing\r\n\r\nWe have seen a basic application which serves HTTP request for the homepage. Routing refers to determining how an application responds to a client request to a particular endpoint, which is a URI (or path) and a specific HTTP request method (GET, POST, and so on).\r\n\r\n    Request Object − The request object represents the HTTP request and has properties for the request query string, parameters, body, HTTP headers, and so on.\r\n\r\n    Response Object − The response object represents the HTTP response that an Express app sends when it gets an HTTP request.\r\n\r\nYou can print req and res objects which provide a lot of information related to HTTP request and response including cookies, sessions, URL, etc.\r\nBasic Routing\r\n\r\nWe have seen a basic application which serves HTTP request for the homepage. Routing refers to determining how an application responds to a client request to a particular endpoint, which is a URI (or path) and a specific HTTP request method (GET, POST, and so on).\r\n\r\n    Request Object − The request object represents the HTTP request and has properties for the request query string, parameters, body, HTTP headers, and so on.\r\n\r\n    Response Object − The response object represents the HTTP response that an Express app sends when it gets an HTTP request.\r\n\r\nYou can print req and res objects which provide a lot of information related to HTTP request and response including cookies, sessions, URL, etc.\r\nBasic Routing\r\n\r\nWe have seen a basic application which serves HTTP request for the homepage. Routing refers to determining how an application responds to a client request to a particular endpoint, which is a URI (or path) and a specific HTTP request method (GET, POST, and so on).Serving Static Files\r\n\r\nExpress provides a built-in middleware express.static to serve static files, such as images, CSS, JavaScript, etc.\r\n\r\nYou simply need to pass the name of the directory where you keep your static assets, to the express.static middleware to start serving the files directly. For example, if you keep your images, CSS, and JavaScript files in a directory named public, you can do this −","lesson_title":"Node.js - Express Framework","lesson_number":7,"_id":{"$oid":"5a49434e7827f824099ac98f"}},{"lesson_body":"What is REST architecture?\r\n\r\nREST stands for REpresentational State Transfer. REST is web standards based architecture and uses HTTP Protocol. It revolves around resource where every component is a resource and a resource is accessed by a common interface using HTTP standard methods. REST was first introduced by Roy Fielding in 2000.\r\n\r\nA REST Server simply provides access to resources and REST client accesses and modifies the resources using HTTP protocol. Here each resource is identified by URIs/ global IDs. REST uses various representation to represent a resource like text, JSON, XML but JSON is the most popular one.\r\nHTTP methods\r\n\r\nFollowing four HTTP methods are commonly used in REST based architecture.\r\n\r\n    GET - This is used to provide a read only access to a resource.\r\n\r\n    PUT - This is used to create a new resource.\r\n\r\n    DELETE - This is used to remove a resource.\r\n\r\n    POST - This is used to update a existing resource or create a new resource.\r\n\r\nRESTful Web Services\r\n\r\nA web service is a collection of open protocols and standards used for exchanging data between applications or systems. Software applications written in various programming languages and running on various platforms can use web services to exchange data over computer networks like the Internet in a manner similar to inter-process communication on a single computer. This interoperability (e.g., communication between Java and Python, or Windows and Linux applications) is due to the use of open standards.\r\n\r\nWeb services based on REST Architecture are known as RESTful web services. These webservices uses HTTP methods to implement the concept of REST architecture. A RESTful web service usually defines a URI, Uniform Resource Identifier a service, which provides resource representation such as JSON and set of HTTP Methods.","lesson_title":"Node.js - RESTful API","lesson_number":8,"_id":{"$oid":"5a4943807827f824099ac990"}}]}
{"_id":{"$oid":"5a492973fb8a10d2c03791f6"},"title":"Angular(2 \u0026 4)","description":"Angular 2, when combined with the MEAN Stack has become a fan favorite for many developers to design scalable and robust applications. While, the original MEAN stack included Angular, along with Node.JS, Express.JS, and MongoDB, the MEAN 2.0, replaced Angular 1 with Angular 4 to create more efficient, modern and high-speed web applications.So, if you want a complete guide to understand Angular 4 and also how you can start developing amazing applications with MEAN Stack 2.0, then this course is right for you!","instructor":" Maximilian Schwarzmüller","lessons":[{"lesson_body":"AngularJS is a very powerful JavaScript Framework. It is used in Single Page Application (SPA) projects. It extends HTML DOM with additional attributes and makes it more responsive to user actions. AngularJS is open source, completely free, and used by thousands of developers around the world. It is licensed under the Apache license version 2.0.AngularJS is an open source web application framework. It was originally developed in 2009 by Misko Hevery and Adam Abrons. It is now maintained by Google. Its latest version is 1.4.3.\r\n\r\nDefinition of AngularJS as put by its official documentation is as follows −\r\n\r\n    AngularJS is a structural framework for dynamic web apps. It lets you use HTML as your template language and lets you extend HTML's syntax to express your application's components clearly and succinctly. Angular's data binding and dependency injection eliminate much of the code you currently have to write. And it all happens within the browser, making it an ideal partner with any server technology.\r\n\r\nFeatures\r\n\r\n    AngularJS is a powerful JavaScript based development framework to create RICH Internet Application(RIA).\r\n\r\n    AngularJS provides developers options to write client side application (using JavaScript) in a clean MVC(Model View Controller) way.\r\n\r\n    Application written in AngularJS is cross-browser compliant. AngularJS automatically handles JavaScript code suitable for each browser.\r\n\r\n    AngularJS is open source, completely free, and used by thousands of developers around the world. It is licensed under the Apache License version 2.0.\r\n\r\nOverall, AngularJS is a framework to build large scale and high performance web application while keeping them as easy-to-maintain.\r\nCore Features\r\n\r\nFollowing are most important core features of AngularJS −\r\n\r\n    Data-binding − It is the automatic synchronization of data between model and view components.\r\n\r\n    Scope − These are objects that refer to the model. They act as a glue between controller and view.\r\n\r\n    Controller − These are JavaScript functions that are bound to a particular scope.\r\n\r\n    Services − AngularJS come with several built-in services for example $https: to make a XMLHttpRequests. These are singleton objects which are instantiated only once in app.\r\n\r\n    Filters − These select a subset of items from an array and returns a new array.\r\n\r\n    Directives − Directives are markers on DOM elements (such as elements, attributes, css, and more). These can be used to create custom HTML tags that serve as new, custom widgets. AngularJS has built-in directives (ngBind, ngModel...)\r\n\r\n    Templates − These are the rendered view with information from the controller and model. These can be a single file (like index.html) or multiple views in one page using \"partials\".\r\n\r\n    Routing − It is concept of switching views.\r\n\r\n    Model View Whatever − MVC is a design pattern for dividing an application into different parts (called Model, View and Controller), each with distinct responsibilities. AngularJS does not implement MVC in the traditional sense, but rather something closer to MVVM (Model-View-ViewModel). The Angular JS team refers it humorously as Model View Whatever.\r\n\r\n    Deep Linking − Deep linking allows you to encode the state of application in the URL so that it can be bookmarked. The application can then be restored from the URL to the same state.\r\n\r\n    Dependency Injection − AngularJS has a built-in dependency injection subsystem that helps the developer by making the application easier to develop, understand, and test.\r\n","lesson_title":"Introduction to AngularJs","lesson_number":1,"_id":{"$oid":"5a4944da7827f824099ac995"}},{"lesson_body":"ou really do not need to set up your own environment to start learning AngularJS. Reason is very simple, we already have set up AngularJS environment online, so that you can execute all the available examples online at the same time when you are doing your theory work. This gives you confidence in what you are reading and to check the result with different options. Feel free to modify any example and execute it online.\r\n\r\n    This screen gives various options of using Angular JS as follows −\r\n\r\n        Downloading and hosting files locally\r\n\r\n            There are two different options legacy and latest. The names itself are self descriptive. legacy has version less than 1.2.x and latest has 1.5.x version.\r\n\r\n            We can also go with the minified, uncompressed or zipped version.\r\n\r\n        CDN access − You also have access to a CDN. The CDN will give you access around the world to regional data centers that in this case, Google host. This means using CDN moves the responsibility of hosting files from your own servers to a series of external ones. This also offers an advantage that if the visitor to your webpage has already downloaded a copy of AngularJS from the same CDN, it won't have to be re-downloaded.\r\n\r\n    Try the new angularJS 2 − Click on this button to download Angular JS beta 2 version.This version is very fast, mobile supported and flexible compare to legacy and latest of AngularJS 1\r\n\r\n    We are using the CDN versions of the library throughout this tutorial.Include AngularJS\r\n\r\nWe have included the AngularJS JavaScript file in the HTML page so we can use AngularJS −If you want to update into latest version of Angular JS, use the following script source or else Check the latest version of AngularJS on their official website.Point to AngularJS app\r\n\r\nNext we tell what part of the HTML contains the AngularJS app. This done by adding the ng-app attribute to the root HTML element of the AngularJS app. You can either add it to html element or body element as shown below −ng-controller tells AngularJS what controller to use with this view. helloTo.title tells AngularJS to write the \"model\" value named helloTo.title to the HTML at this location.This code registers a controller function named HelloController in the angular module named myapp. We will study more about modules and controllers in their respective chapters. The controller function is registered in angular via the angular.module(...).controller(...) function call.\r\n\r\nThe $scope parameter passed to the controller function is the model. The controller function adds a helloTo JavaScript object, and in that object it adds a title field.When the page is loaded in the browser, following things happen −\r\n\r\n    HTML document is loaded into the browser, and evaluated by the browser. AngularJS JavaScript file is loaded, the angular global object is created. Next, JavaScript which registers controller functions is executed.\r\n\r\n    Next AngularJS scans through the HTML to look for AngularJS apps and views. Once view is located, it connects that view to the corresponding controller function.\r\n\r\n    Next, AngularJS executes the controller functions. It then renders the views with data from the model populated by the controller. The page is now ready.\r\n","lesson_title":"AngularJS - Environment Setup","lesson_number":2,"_id":{"$oid":"5a49452e7827f824099ac996"}},{"lesson_body":"Model View Controller or MVC as it is popularly called, is a software design pattern for developing web applications. A Model View Controller pattern is made up of the following three parts −\r\n\r\n    Model − It is the lowest level of the pattern responsible for maintaining data.\r\n\r\n    View − It is responsible for displaying all or a portion of the data to the user.\r\n\r\n    Controller − It is a software Code that controls the interactions between the Model and View.\r\n\r\nMVC is popular because it isolates the application logic from the user interface layer and supports separation of concerns. The controller receives all requests for the application and then works with the model to prepare any data needed by the view. The view then uses the data prepared by the controller to generate a final presentable response.The Model\r\n\r\nThe model is responsible for managing application data. It responds to the request from view and to the instructions from controller to update itself.\r\nThe View\r\n\r\nA presentation of data in a particular format, triggered by the controller's decision to present the data. They are script-based template systems such as JSP, ASP, PHP and very easy to integrate with AJAX technology.\r\nThe Controller\r\n\r\nThe controller responds to user input and performs interactions on the data model objects. The controller receives input, validates it, and then performs business operations that modify the state of the data model.\r\n\r\nAngularJS is a MVC based framework. In the coming chapters, we will see how AngularJS uses MVC methodology.","lesson_title":"AngularJS - MVC Architecture","lesson_number":3,"_id":{"$oid":"5a49455f7827f824099ac997"}},{"lesson_body":"AngularJS directives are used to extend HTML. These are special attributes starting with ng- prefix. We're going to discuss following directives −\r\n\r\n    ng-app − This directive starts an AngularJS Application.\r\n\r\n    ng-init − This directive initializes application data.\r\n\r\n    ng-model − This directive binds the values of AngularJS application data to HTML input controls.\r\n\r\n    ng-repeat − This directive repeats html elements for each item in a collection.\r\n\r\nng-app directive\r\n\r\nng-app directive starts an AngularJS Application. It defines the root element. It automatically initializes or bootstraps the application when web page containing AngularJS Application is loaded. It is also used to load various AngularJS modules in AngularJS Application. In following example, we've defined a default AngularJS application using ng-app attribute of a div element.ng-init directive\r\n\r\nng-init directive initializes an AngularJS Application data. It is used to put values to the variables to be used in the application. In following example, we'll initialize an array of countries. We're using JSON syntax to define array of countries.ng-model directive\r\n\r\nThis directive binds the values of AngularJS application data to HTML input controls. In following example, we've defined a model named \"name\".ng-repeat directive\r\n\r\nng-repeat directive repeats html elements for each item in a collection. In following example, we've iterated over array of countries.","lesson_title":"AngularJS - Directives","lesson_number":4,"_id":{"$oid":"5a4945ca7827f824099ac998"}},{"lesson_body":"Angular 2 is an open source JavaScript framework to build web applications in HTML and JavaScript. This tutorial looks at the various aspects of Angular 2 framework which includes the basics of the framework, the setup of Angular and how to work with the various aspects of the framework. Other topics discussed in the tutorial are advanced chapters such as interfaces, nested components and services within Angular. Topics such as routing, modules, and arrays are also dealt with in this tutorial.Angular JS is an open source framework built over JavaScript. It was built by the developers at Google. This framework was used to overcome obstacles encountered while working with Single Page applications. Also, testing was considered as a key aspect while building the framework. It was ensured that the framework could be easily tested. The initial release of the framework was in October 2010.\r\nFeatures of Angular 2\r\n\r\nFollowing are the key features of Angular 2 −\r\n\r\n    Components − The earlier version of Angular had a focus of Controllers but now has changed the focus to having components over controllers. Components help to build the applications into many modules. This helps in better maintaining the application over a period of time.\r\n\r\n    TypeScript − The newer version of Angular is based on TypeScript. This is a superset of JavaScript and is maintained by Microsoft.\r\n\r\n    Services − Services are a set of code that can be shared by different components of an application. So for example if you had a data component that picked data from a database, you could have it as a shared service that could be used across multiple applications.\r\n\r\nIn addition, Angular 2 has better event-handling capabilities, powerful templates, and better support for mobile devices.\r\nComponents of Angular 2\r\n\r\nAngular 2 has the following components −\r\n\r\n    Modules − This is used to break up the application into logical pieces of code. Each piece of code or module is designed to perform a single task.\r\n\r\n    Component − This can be used to bring the modules together.\r\n\r\n    Templates − This is used to define the views of an Angular JS application.\r\n\r\n    Metadata − This can be used to add more data to an Angular JS class.\r\n\r\n    Service − This is used to create components which can be shared across the entire application.\r\n","lesson_title":"Introduction to Angular2","lesson_number":5,"_id":{"$oid":"5a4946357827f824099ac999"}},{"lesson_body":"Each application consists of Components. Each component is a logical boundary of functionality for the application. You need to have layered services, which are used to share the functionality across components.Following is the anatomy of a Component. A component consists of −\r\n\r\n    Class − This is like a C++ or Java class which consists of properties and methods.\r\n\r\n    Metadata − This is used to decorate the class and extend the functionality of the class.\r\n\r\n    Template − This is used to define the HTML view which is displayed in the application.\r\nEach application is made up of modules. Each Angular 2 application needs to have one Angular Root Module. Each Angular Root module can then have multiple components to separate the functionality.","lesson_title":"Angular 2 - Architecture","lesson_number":6,"_id":{"$oid":"5a4946717827f824099ac99a"}},{"lesson_body":"ngular 4 is a JavaScript framework for building web applications and apps in JavaScript, html, and TypeScript, which is a superset of JavaScript. Angular provides built-in features for animation, http service, and materials which in turn has features such as auto-complete, navigation, toolbar, menus, etc. The code is written in TypeScript, which compiles to JavaScript and displays the same in the browser.There are three major releases of Angular. The first version that was released is Angular1, which is also called AngularJS. Angular1 was followed by Angular2, which came in with a lot of changes when compared to Angular1.\r\n\r\nThe structure of Angular is based on the components/services architecture. AngularJS was based on the model view controller. Angular 4 released in March 2017 proves to be a major breakthrough and is the latest release from the Angular team after Angular2.\r\n\r\nAngular 4 is almost the same as Angular 2. It has a backward compatibility with Angular 2. Projects developed in Angular 2 will work without any issues with Angular 4.Animation Package\r\n\r\nAnimation in Angular 4 is available as a separate package and needs to be imported from @angular/animations. In Angular2, it was available with @angular/core. It is still kept the same for its backward compatibility aspect.\r\nTemplate\r\n\r\nAngular 4 uses \u003cng-template\u003e as the tag instead of \u003ctemplate\u003e; the latter was used in Angular2. The reason Angular 4 changed \u003ctemplate\u003e to \u003cng-template\u003e is because of the name conflict of the \u003ctemplate\u003e tag with the html \u003ctemplate\u003e standard tag. It will deprecate completely going ahead. This is one of the major changes in Angular 4.\r\nTypeScript 2.2\r\n\r\nAngular 4 is updated to a recent version of TypeScript, which is 2.2. This helps improve the speed and gives better type checking in the project.\r\nPipe Title Case\r\n\r\nAngular 4 has added a new pipe title case, which changes the first letter of each word into uppercase.Http Search Parameters\r\n\r\nSearch parameters to the http get api is simplified. We do not need to call URLSearchParams for the same as was being done in Angular2.\r\nSmaller and Faster Apps\r\n\r\nAngular 4 applications are smaller and faster when compared to Angular2. It uses the TypeScript version 2.2, the latest version which makes the final compilation small in size.","lesson_title":"Introduction to Angular4","lesson_number":7,"_id":{"$oid":"5a4946de7827f824099ac99b"}},{"lesson_body":"Major part of the development with Angular 4 is done in the components. Components are basically classes that interact with the .html file of the component, which gets displayed on the browser. We have seen the file structure in one of our previous chapters. The file structure has the app component and it consists of the following files −\r\n\r\n    app.component.css\r\n\r\n    app.component.html\r\n\r\n    app.component.spec.ts\r\n\r\n    app.component.ts\r\n\r\n    app.module.ts\r\n\r\nThe above files were created by default when we created new project using the angular-cli command.\r\n\r\nIf you open up the app.module.ts file, it has some libraries which are imported and also a declarative .he declarations include the AppComponent variable, which we have already imported. This becomes the parent component.\r\n\r\nNow, angular-cli has a command to create your own component. However, the app component which is created by default will always remain the parent and the next components created will form the child components.If you see the above new-cmp.component.ts file, it creates a new class called NewCmpComponent, which implements OnInit.In, which has a constructor and a method called ngOnInit(). ngOnInit is called by default when the class is executed.\r\n\r\nLet us check how the flow works. Now, the app component, which is created by default becomes the parent component. Any component added later becomes the child component.In the declarator reference to the selector, templateUrl and styleUrl are given. The selector here is nothing but the tag which is placed in the index.html file that we saw above.\r\n\r\nThe class AppComponent has a variable called title, which is displayed in the browser.It has just the html code and the variable title in curly brackets. It gets replaced with the value, which is present in the app.component.ts file. This is called binding. We will discuss the concept of binding in a subsequent chapter.\r\n\r\nNow that we have created a new component called new-cmp. The same gets included in the app.module.ts file, when the command is run for creating a new component.\r\n\r\napp.module.ts has a reference to the new component created.","lesson_title":"Angular 4 - Components","lesson_number":8,"_id":{"$oid":"5a4947387827f824099ac99c"}},{"lesson_body":"irectives in Angular is a js class, which is declared as @directive. We have 3 directives in Angular. The directives are listed below −\r\nComponent Directives\r\n\r\nThese form the main class having details of how the component should be processed, instantiated and used at runtime.\r\nStructural Directives\r\n\r\nA structure directive basically deals with manipulating the dom elements. Structural directives have a * sign before the directive. For example, *ngIf and *ngFor.\r\nAttribute Directives\r\n\r\nAttribute directives deal with changing the look and behavior of the dom element. You can create your own directives as shown below.\r\nHow to Create Custom Directives?\r\n\r\nIn this section, we will discuss about Custom Directives to be used in components. Custom directives are created by us and are not standard.\r\n\r\nLet us see how to create the custom directive. We will create the directive using the command line. The command to create the directive using the command line is −his is how it appears in the command line\r\n\r\nC:\\projectA4\\Angular 4-app\u003eng g directive changeText\r\ninstalling directive\r\n   create src\\app\\change-text.directive.spec.ts\r\n   create src\\app\\change-text.directive.ts\r\n   update src\\app\\app.module.ts\r\n\r\nThe above files, i.e., change-text.directive.spec.ts and change-text.directive.ts get created and the app.module.ts file is updated.","lesson_title":"Angular 4 - Directives","lesson_number":9,"_id":{"$oid":"5a49476c7827f824099ac99d"}},{"lesson_body":"Materials offer a lot of built-in modules for your project. Features such as autocomplete, datepicker, slider, menus, grids, and toolbar are available for use with materials in Angular 4.\r\n\r\nTo use materials, we need to import the package. Angular 2 also has all the above features but they are available as part of the @angular/core module. Angular 4 has come up with a separate module @angular/materials.. This helps the user to import the required materials.\r\n\r\nTo start using materials, you need to install two packages - materials and cdk. Material components depend on the animation module for advanced features, hence you need the animation package for the same, i.e., @angular/animations. The package has already been updated in the previous chapter.npm install --save @angular/material @angular/cdk.Menu\r\n\r\nTo add menu, \u003cmd-menu\u003e\u003c/md-menu\u003e is used. The file and Save As items are added to the button under md-menu. There is a main button added Menu. The reference of the same is given the \u003cmd-menu\u003e by using [mdMenuTriggerFor]=”menu” and using the menu with # in \u003cmd-menu\u003e.\r\nSideNav\r\n\r\nTo add sidenav, we need \u003cmd-sidenav-container\u003e\u003c/md-sidenav-container\u003e. \u003cmd-sidenav\u003e\u003c/md-sidenav\u003e is added as a child to the container. There is another div added, which triggers the sidenav by using (click)=”sidenav.open()”. Following is the display of the menu and the sidenav in the browser −","lesson_title":"Angular 4 - Materials","lesson_number":10,"_id":{"$oid":"5a4947b57827f824099ac99e"}}]}
{"_id":{"$oid":"5a492af5fb8a10d2c03791f7"},"title":"Google Analytics","description":"Google Analytics is the most important tool for Digital marketers. Everything from how to setup your account to maximize your results, to what are the most important reports to pay attention to, and a number of advanced tactics as well. If you’re interested in Google Analytics you won’t want to miss this course.Traffic reports are required reading for any business looking to generate leads or make sales online. A good analytics program can quickly tell you what’s working and what’s not in your Web marketing campaign.","instructor":" Shefali Naidu","lessons":[{"lesson_body":"Web Analytics is the methodological study of online/offline patterns and trends. It is a technique that you can employ to collect, measure, report, and analyze your website data. It is normally carried out to analyze the performance of a website and optimize its web usage.\r\n\r\nWe use web analytics to track key metrics and analyze visitors’ activity and traffic flow. It is a tactical approach to collect data and generate reports.\r\nImportance of Web Analytics\r\n\r\nWe need Web Analytics to assess the success rate of a website and its associated business. Using Web Analytics, we can −\r\n\r\n    Assess web content problems so that they can be rectified\r\n    Have a clear perspective of website trends\r\n    Monitor web traffic and user flow\r\n    Demonstrate goals acquisition\r\n    Figure out potential keywords\r\n    Identify segments for improvement\r\n    Find out referring sources\r\n\r\nWeb Analytics Process\r\n\r\nThe primary objective of carrying out Web Analytics is to optimize the website in order to provide better user experience. It provides a data-driven report to measure visitors’ flow throughout the website.\r\n\r\nTake a look at the following illustration. It depicts the process of web analytics.\r\n\r\n    Set the business goals.\r\n\r\n    To track the goal achievement, set the Key Performance Indicators (KPI).\r\n\r\n    Collect correct and suitable data.\r\n\r\n    To extract insights, Analyze data.\r\n\r\n    Based on assumptions learned from the data analysis, Test alternatives.\r\n\r\n    Based on either data analysis or website testing, Implement insights.\r\nWeb Analytics is an ongoing process that helps in attracting more traffic to a site and thereby, increasing the Return on Investment.","lesson_title":"Introduction to Web Analytics","lesson_number":1,"_id":{"$oid":"5a493cdf7827f824099ac97f"}},{"lesson_body":"Create and manage Custom Reports\r\n\r\nA custom report is a report that you create. You pick the dimensions and metrics and decide how they should be displayed. Learn more about Custom Reports.\r\nIn this article:\r\n\r\n    Create a Custom Report\r\n    Access, manage, and share Custom Reports\r\n    Back up Custom Reports with Custom Tables (Google Analytics 360)\r\n\r\nCreate a Custom Report\r\n\r\n    Sign in to Google Analytics.\r\n    Navigate to your view.\r\n    Open Reports.\r\n    Click Customization \u003e Custom Reports \u003e +New Custom Report.\r\n    Enter a Title.\r\n    (Optional) Click +add report tab.\r\n    Every report has at least 1 tab, but you can add more.\r\n    You can customize the report types in each Report Tab.\r\n    Select a report type: Explorer, Flat Table, Map Overlay, or Funnel.\r\n    Click to expand and learn more about the report types.\r\n\r\n    You need to select a new report type for every tab you add to the report. Each tab can have a different report type. For example, you could create Tab 1 as a Map Overlay and Tab 2 as a Flat Table. This would allow you to have multiple tabs to have different visualization types in one report.\r\n        Explorer: The standard Analytics report. Includes a line graph and a data table that includes dynamic elements like a search/sort option and secondary dimensions.\r\n        Flat Table: A static, sortable table that displays data in rows.\r\n        Map Overlay: A map of the world. Different regions and countries display in darker colors to indicate traffic and engagement volume.\r\n        Funnel: A conversion funnel you define.\r\n    Define your dimension and metrics.\r\n    The options for each report type vary because each type displays data in different ways.\r\n    (Optional) Click +add filter to limit the report to specific dimensions.\r\n    Click to expand and learn more about these filters.\r\n    This lets you restrict the data that appears in the report. For example, if you create a report with the dimension Browser Version, you could add a filter to display only specific browsers in the report by creating an Include filter on the dimension Browser, with the Exact match of Chrome. With this configuration, you would only see data in your report for the Chrome browser, so you could compare performances of each version of Chrome, and exclude all data from other browsers.\r\n    (Optional) Select where this report should appear. Use the dropdown menu to select specific views, or select All views associated with this account to allow this report on all views you have access to.\r\n    Click Save.\r\nFor more info :https://support.google.com/analytics/answer/1151300?hl=en","lesson_title":"Using Google Analytics Reports ","lesson_number":2,"_id":{"$oid":"5a493d7c7827f824099ac980"}},{"lesson_body":"Acquisition means ‘to acquire.’ Acquisition analysis is carried out to find out the sources from where your web traffic originates. Using acquisition analysis, you can −\r\n\r\n    Capture traffic from all channels, particular source/medium, and from referrals.\r\n\r\n    Trace traffic from AdWords (paid search).\r\n\r\n    See traffic from search engines. Here, you can see Queries, triggered landing pages, and geographical summary.\r\n\r\n    Track social media traffic. It helps you to identify networks where your users are engaged. You can see referrals from where your traffic originates. You can also have a view of your hub activity, bookmarking sites follow-up, etc. In the same tab, you can have a look at your endorsements in details. It helps you measure the impact of social media on your website.\r\n\r\n    See which plug-ins gave you traffic.\r\n\r\n    Have a look at all the campaigns you built throughout your website with detailed statistics of paid/organic keywords and the cost incurred on it.\r\n","lesson_title":"Acquisition Analysis","lesson_number":3,"_id":{"$oid":"5a493dc97827f824099ac981"}},{"lesson_body":"Behavior analysis monitors users’ activities on a website. You can find behavioral data under the following four segments −\r\n\r\n    Site Content − It shows how many pages were viewed. You can see the detailed interaction of data across all pages or in segments like content drill-down, landing pages, and exit pages. Content drill-down is breaking up of data into sub-folders. Landing page is the page where the user lands, and exit page is where the user exits your site. You can measure the behavioral flow in terms of content.\r\n\r\n    Site Speed − Here, you can capture page load time, execution speed, and performance data. You can see how quickly the browser can parse through the page. Further, you can measure page timings, user timings, and get speed suggestion. It helps you to know where you are lagging.\r\n\r\n    Site Search − It gives you a full picture of how the users search across your site, what they normally look for, and how they arrive at a particular landing page. You can analyze what they search for before landing on your website.\r\n\r\n    Events − Events are visitors’ actions with content, which can be traced independently. Example − downloads, sign up, log-in, etc.\r\n","lesson_title":"Behavior Analysis","lesson_number":4,"_id":{"$oid":"5a493de57827f824099ac982"}},{"lesson_body":"Conversion is a goal completion or a transaction by a user on your website. For example, download, checkout, buy, etc. To track conversions in analytics, you need to define a goal and set a URL that is traceable.\r\n\r\n    Goals − Metrics that measure a profitable activity that you want the user to complete. You can set them to track the actions. Each time a goal is achieved, a conversion is added to your data. You can observe goal completion, value, reverse path, and goal flow.\r\n\r\n    Ecommerce − You can set ecommerce tracking to know what the users buy from your website. It helps you to find product performance, sale performance, transactions, and purchase time. Based on these data, you can analyze what can be beneficial and what can incur you loss.\r\n\r\n    Multi-channel funnels − Multi-channel funnels or MCF reports the source of conversion; what roles the website plays, referrals’ role in that conversion; and what all slabs did when users pass through landing page to conversion. For example, a user searched for a query on Google search page, he visited the website, but did not convert. Later on, he directly typed your website name and made a purchase. All these activities can be traced on MCF.\r\n\r\n    Attribution − Attribution modeling credits sales and conversions to touch points in conversion tracking. It lets you decide what platforms or strategy or module is the best for your business. Suppose a person visited your website through AdWords ad and made no purchase. A month later, he visits via a social platform and again does not buy. Third time, he visited directly and converted. Here, the last interaction model will credit direct for the conversion, whereas first interaction model will assign credit to paid medium. This way, you can analyze what module should be credited for a conversion.\r\n\r\n","lesson_title":"Conversion Analysis","lesson_number":5,"_id":{"$oid":"5a493e107827f824099ac983"}},{"lesson_body":"Dashboard is an interface showing graphical status of the trends of your business key performance indicators. This helps you to take instantaneous and intelligent decisions. It gives you a visual display of important data that can be encapsulated in a single space to let you monitor in a glance.In Google analytics, you can create dashboards according to your requirements. Dashboards are used for finding data. With the help of dashboards, you can quickly analyze the data. In dashboard, you have to create widgets as per your requirements.ypes of Dashboards\r\n\r\nYou can create dashboards according to your requirements. Following are the main types of dashboards −\r\n\r\n    SEO dashboardContent dashboard\r\n    Content dashboard\r\n    Website performance dashboard\r\n    Real time overview dashboard\r\n    Ecommerce dashboard\r\n    Social Media dashboard\r\n    PPC dashboard\r\n\r\nIn every dashboard, you have to create widgets. Widgets are form in graphical or in numbers.\r\n\r\nFor example, if you want to create a dashboard for SEO, you have to create a widget for the total traffic, for the organic traffic, for the keywords, etc. You can analyze these metrics with the help of SEO dashboard.\r\n\r\nIf you want to create a dashboard for website performance, then you have to create a widget for website avg. page load time, Website server response time, Page load time for mobile, and Check page load time by browser. With the help of these widgets, you can easily analyze the website performance.Metrics for Every Dashboard\r\n\r\n    Search Engine Optimization (SEO) − Organic traffic, Website total traffic, Keyword used in Organic, Top landing pages, etc.\r\n\r\n    Content − In content dashboard, you have to monitor traffic for blog section, Conversion by blog post, and Top landing page by exit.\r\n\r\n    Website Performance Dashboard − Avg. page load time, Mobile page load time, Page load time by browser, and Website server response time.\r\n\r\n    Real Time Overview Dashboard− In real time overview, you can set a widget for real time traffic, Real time traffic source, and real time traffic landing pages.\r\n\r\n    Ecommerce Dashboard − In ecommerce total traffic, Landing by products, and Total sale by products.\r\n\r\n    Social Media Dashboard − In social media traffic by social media channel, Sale by social media, most socially shared content.\r\n\r\n    PPC dashboard − In pay per click (PPC) dashboard, you need to include clicks, impressions, CTR, converted clicks, etc.\r\n","lesson_title":"Dashboard Implementation","lesson_number":6,"_id":{"$oid":"5a493e6d7827f824099ac984"}}]}
